raiden00pl/nuttx/arch/arm/src/nrf54l/nrf54l_usbd.c
/****************************************************************************
 * arch/arm/src/nrf54l/nrf54l_usbd.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/param.h>
#include <sys/types.h>
#include <inttypes.h>
#include <stdint.h>
#include <stdbool.h>
#include <stdlib.h>
#include <string.h>
#include <assert.h>
#include <errno.h>
#include <nuttx/debug.h>

#include <nuttx/arch.h>
#include <nuttx/kmalloc.h>
#include <nuttx/mutex.h>
#include <nuttx/usb/usb.h>
#include <nuttx/usb/usbdev.h>
#include <nuttx/usb/usbdev_trace.h>
#include <nuttx/wqueue.h>

#include <nuttx/irq.h>
#include <arch/board/board.h>

#include "chip.h"
#include "nrf54l_usbhs.h"
#include "hardware/nrf54l_usbd.h"
#include "arm_internal.h"

#ifdef CONFIG_USBDEV

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Configuration ************************************************************/

#ifndef CONFIG_USBDEV_EP0_MAXSIZE
#  define CONFIG_USBDEV_EP0_MAXSIZE 64
#endif

#if CONFIG_USBDEV_EP0_MAXSIZE != 8 && CONFIG_USBDEV_EP0_MAXSIZE != 16 && \
    CONFIG_USBDEV_EP0_MAXSIZE != 32 && CONFIG_USBDEV_EP0_MAXSIZE != 64
#  error Unsupported endpoint 0 packet size
#endif

#if defined(CONFIG_USBDEV_DUALSPEED) && CONFIG_USBDEV_EP0_MAXSIZE != 64
#  error High-speed endpoint 0 requires 64-byte packets
#endif

#ifndef CONFIG_USBDEV_SETUP_MAXDATASIZE
#  define CONFIG_USBDEV_SETUP_MAXDATASIZE CONFIG_USBDEV_EP0_MAXSIZE
#endif

#ifndef CONFIG_USBDEV_MAXPOWER
#  define CONFIG_USBDEV_MAXPOWER 100  /* mA */
#endif

/* FIFO sizes are in 32-bit words. Reserve one high-speed bulk packet per
 * IN endpoint and a shared receive FIFO for all sixteen OUT endpoints.
 */

#define NRF54L_NENDPOINTS      16
#define NRF54L_RXFIFO_WORDS    768
#define NRF54L_EP0_TXFIFO_WORDS 16
#define NRF54L_TXFIFO_WORDS    128

#define OTG_GINT_RC_W1   (OTG_GINT_MMIS     | \
                          OTG_GINT_SOF      | \
                          OTG_GINT_ESUSP    | \
                          OTG_GINT_USBSUSP  | \
                          OTG_GINT_USBRST   | \
                          OTG_GINT_ENUMDNE  | \
                          OTG_GINT_ISOODRP  | \
                          OTG_GINT_EOPF     | \
                          OTG_GINT_IISOIXFR | \
                          OTG_GINT_IISOOXFR | \
                          OTG_GINT_RSTDET   | \
                          OTG_GINT_LPMINT   | \
                          OTG_GINT_CIDSCHG  | \
                          OTG_GINT_DISC     | \
                          OTG_GINT_SRQ      | \
                          OTG_GINT_WKUP)

/* Debug ********************************************************************/

/* Trace error codes */

#define NRF54L_TRACEERR_ALLOCFAIL            0x01
#define NRF54L_TRACEERR_BADCLEARFEATURE      0x02
#define NRF54L_TRACEERR_BADDEVGETSTATUS      0x03
#define NRF54L_TRACEERR_BADEPNO              0x04
#define NRF54L_TRACEERR_BADEPGETSTATUS       0x05
#define NRF54L_TRACEERR_BADGETCONFIG         0x06
#define NRF54L_TRACEERR_BADGETSETDESC        0x07
#define NRF54L_TRACEERR_BADGETSTATUS         0x08
#define NRF54L_TRACEERR_BADSETADDRESS        0x09
#define NRF54L_TRACEERR_BADSETCONFIG         0x0a
#define NRF54L_TRACEERR_BADSETFEATURE        0x0b
#define NRF54L_TRACEERR_BADTESTMODE          0x0c
#define NRF54L_TRACEERR_BINDFAILED           0x0d
#define NRF54L_TRACEERR_DISPATCHSTALL        0x0e
#define NRF54L_TRACEERR_DRIVER               0x0f
#define NRF54L_TRACEERR_DRIVERREGISTERED     0x10
#define NRF54L_TRACEERR_EP0NOSETUP           0x11
#define NRF54L_TRACEERR_EP0SETUPSTALLED      0x12
#define NRF54L_TRACEERR_EPINNULLPACKET       0x13
#define NRF54L_TRACEERR_EPINUNEXPECTED       0x14
#define NRF54L_TRACEERR_EPOUTNULLPACKET      0x15
#define NRF54L_TRACEERR_EPOUTUNEXPECTED      0x16
#define NRF54L_TRACEERR_INVALIDCTRLREQ       0x17
#define NRF54L_TRACEERR_INVALIDPARMS         0x18
#define NRF54L_TRACEERR_IRQREGISTRATION      0x19
#define NRF54L_TRACEERR_NOEP                 0x1a
#define NRF54L_TRACEERR_NOTCONFIGURED        0x1b
#define NRF54L_TRACEERR_EPOUTQEMPTY          0x1c
#define NRF54L_TRACEERR_EPINREQEMPTY         0x1d
#define NRF54L_TRACEERR_NOOUTSETUP           0x1e
#define NRF54L_TRACEERR_POLLTIMEOUT          0x1f

/* Trace interrupt codes */

#define NRF54L_TRACEINTID_USB                1       /* USB Interrupt entry/exit */
#define NRF54L_TRACEINTID_INTPENDING         2       /* On each pass through the loop */

#define NRF54L_TRACEINTID_EPOUT              (10 + 0) /* First level interrupt decode */
#define NRF54L_TRACEINTID_EPIN               (10 + 1)
#define NRF54L_TRACEINTID_MISMATCH           (10 + 2)
#define NRF54L_TRACEINTID_WAKEUP             (10 + 3)
#define NRF54L_TRACEINTID_SUSPEND            (10 + 4)
#define NRF54L_TRACEINTID_SOF                (10 + 5)
#define NRF54L_TRACEINTID_RXFIFO             (10 + 6)
#define NRF54L_TRACEINTID_DEVRESET           (10 + 7)
#define NRF54L_TRACEINTID_ENUMDNE            (10 + 8)
#define NRF54L_TRACEINTID_IISOIXFR           (10 + 9)
#define NRF54L_TRACEINTID_IISOOXFR           (10 + 10)
#define NRF54L_TRACEINTID_SRQ                (10 + 11)
#define NRF54L_TRACEINTID_OTG                (10 + 12)

#define NRF54L_TRACEINTID_EPOUT_XFRC         (40 + 0) /* EPOUT second level decode */
#define NRF54L_TRACEINTID_EPOUT_EPDISD       (40 + 1)
#define NRF54L_TRACEINTID_EPOUT_SETUP        (40 + 2)
#define NRF54L_TRACEINTID_DISPATCH           (40 + 3)

#define NRF54L_TRACEINTID_GETSTATUS          (50 + 0) /* EPOUT third level decode */
#define NRF54L_TRACEINTID_EPGETSTATUS        (50 + 1)
#define NRF54L_TRACEINTID_DEVGETSTATUS       (50 + 2)
#define NRF54L_TRACEINTID_IFGETSTATUS        (50 + 3)
#define NRF54L_TRACEINTID_CLEARFEATURE       (50 + 4)
#define NRF54L_TRACEINTID_SETFEATURE         (50 + 5)
#define NRF54L_TRACEINTID_SETADDRESS         (50 + 6)
#define NRF54L_TRACEINTID_GETSETDESC         (50 + 7)
#define NRF54L_TRACEINTID_GETCONFIG          (50 + 8)
#define NRF54L_TRACEINTID_SETCONFIG          (50 + 9)
#define NRF54L_TRACEINTID_GETSETIF           (50 + 10)
#define NRF54L_TRACEINTID_SYNCHFRAME         (50 + 11)

#define NRF54L_TRACEINTID_EPIN_XFRC          (70 + 0) /* EPIN second level decode */
#define NRF54L_TRACEINTID_EPIN_TOC           (70 + 1)
#define NRF54L_TRACEINTID_EPIN_ITTXFE        (70 + 2)
#define NRF54L_TRACEINTID_EPIN_EPDISD        (70 + 3)
#define NRF54L_TRACEINTID_EPIN_TXFE          (70 + 4)

#define NRF54L_TRACEINTID_EPIN_EMPWAIT       (80 + 0) /* EPIN second level decode */

