raiden00pl/nuttx/arch/arm/src/nrf54l/nrf54l_usbd.c
#define NRF54L_TRACEINTID_OUTNAK             (90 + 0) /* RXFLVL second level decode */
#define NRF54L_TRACEINTID_OUTRECVD           (90 + 1)
#define NRF54L_TRACEINTID_OUTDONE            (90 + 2)
#define NRF54L_TRACEINTID_SETUPDONE          (90 + 3)
#define NRF54L_TRACEINTID_SETUPRECVD         (90 + 4)

/* Endpoints ****************************************************************/

/* Odd physical endpoint numbers are IN; even are OUT */

#define NRF54L_EPPHYIN2LOG(epphy)     ((uint8_t)(epphy)|USB_DIR_IN)
#define NRF54L_EPPHYOUT2LOG(epphy)    ((uint8_t)(epphy)|USB_DIR_OUT)

/* Endpoint 0 */

#define EP0                          (0)

/* The set of all endpoints available to the class implementation (1-7) */

#define NRF54L_EP_AVAILABLE           (0xfffe)     /* All available endpoints */

/* Maximum packet sizes for full speed endpoints */

#define NRF54L_MAXPACKET              (64)         /* Max packet size (1-64) */

/* Delays *******************************************************************/

#define NRF54L_READY_DELAY            200000
#define NRF54L_FLUSH_DELAY            200000

/* Request queue operations *************************************************/

#define nrf54l_rqempty(ep)            ((ep)->head == NULL)
#define nrf54l_rqpeek(ep)             ((ep)->head)

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* Overall device state */

enum nrf54l_devstate_e
{
  DEVSTATE_DEFAULT = 0,    /* Power-up, unconfigured state.  This state simply
                            * means that the device is not yet been given an
                            * address.
                            *   SET:    At initialization, uninitialization,
                            *           reset, and whenever the device address
                            *           is set to zero
                            *   TESTED: Never
                            */
  DEVSTATE_ADDRESSED,      /* Device address has been assigned, not no
                            * configuration has yet been selected.
                            *   SET:    When either a non-zero device address
                            *           is first assigned or when the device
                            *           is unconfigured (with configuration == 0)
                            *   TESTED: never
                            */
  DEVSTATE_CONFIGURED,     /* Address assigned and configured:
                            *   SET:    When the device has been addressed and
                            *           an non-zero configuration has been selected.
                            *   TESTED: In many places to assure that the USB device
                            *           has been properly configured by the host.
                            */
};

/* Endpoint 0 states */

enum nrf54l_ep0state_e
{
  EP0STATE_IDLE = 0,       /* Idle State, leave on receiving a SETUP packet or
                            * epsubmit:
                            *   SET:    In nrf54l_epin() and nrf54l_epout() when
                            *           we revert from request processing to
                            *           SETUP processing.
                            *   TESTED: Never
                            */
  EP0STATE_SETUP_OUT,      /* OUT SETUP packet received.  Waiting for the DATA
                            * OUT phase of SETUP Packet to complete before
                            * processing a SETUP command (without a USB request):
                            *   SET:    Set in nrf54l_rxinterrupt() when SETUP OUT
                            *           packet is received.
                            *   TESTED: In nrf54l_ep0out_receive()
                            */
  EP0STATE_SETUP_READY,    /* IN SETUP packet received -OR- OUT SETUP packet and
                            * accompanying data have been received.  Processing
                            * of SETUP command will happen soon.
                            *   SET:    (1) nrf54l_ep0out_receive() when the OUT
                            *           SETUP data phase completes, or (2)
                            *           nrf54l_rxinterrupt() when an IN SETUP is
                            *           packet received.
                            *   TESTED: Tested in nrf54l_epout_interrupt() when
                            *           SETUP phase is done to see if the SETUP
                            *           command is ready to be processed.  Also
                            *           tested in nrf54l_ep0out_setup() just to
                            *           double-check that we have a SETUP request
                            *           and any accompanying data.
                            */
  EP0STATE_SETUP_PROCESS,  /* SETUP Packet is being processed by nrf54l_ep0out_setup():
                            *   SET:    When SETUP packet received in EP0 OUT
                            *   TESTED: Never
                            */
  EP0STATE_SETUPRESPONSE,  /* Short SETUP response write (without a USB request):
                            *   SET:    When SETUP response is sent by
                            *           nrf54l_ep0in_setupresponse()
                            *   TESTED: Never
                            */
  EP0STATE_DATA_IN,        /* Waiting for data out stage (with a USB request):
                            *   SET:    In nrf54l_epin_request() when a write
                            *           request is processed on EP0.
                            *   TESTED: In nrf54l_epin() to see if we should
                            *           revert to SETUP processing.
                            */
  EP0STATE_DATA_OUT        /* Waiting for data in phase to complete ( with a
                            * USB request)
                            *   SET:    In nrf54l_epout_request() when a read
                            *           request is processed on EP0.
                            *   TESTED: In nrf54l_epout() to see if we should
                            *           revert to SETUP processing
                            */
};

/* Parsed control request */

struct nrf54l_ctrlreq_s
{
  uint8_t  type;
  uint8_t  req;
  uint16_t value;
  uint16_t index;
  uint16_t len;
};

/* A container for a request so that the request may be retained in a list */

struct nrf54l_req_s
{
  struct usbdev_req_s  req;       /* Standard USB request */
  struct nrf54l_req_s  *flink;    /* Supports a singly linked list */
};

/* This is the internal representation of an endpoint */

