raiden00pl/nuttx/arch/arm/src/nrf54l/nrf54l_usbd.c
struct nrf54l_ep_s
{
  /* Common endpoint fields.  This must be the first thing defined in the
   * structure so that it is possible to simply cast from struct usbdev_ep_s
   * to struct nrf54l_ep_s.
   */

  struct usbdev_ep_s      ep;          /* Standard endpoint structure */

  /* NRF54L-specific fields */

  struct nrf54l_usbdev_s *dev;          /* Reference to private driver data */
  struct nrf54l_req_s    *head;         /* Request list for this endpoint */
  struct nrf54l_req_s    *tail;
  uint8_t                epphy;        /* Physical EP address */
  uint8_t                eptype:2;     /* Endpoint type */
  uint8_t                active:1;     /* 1: A request is being processed */
  uint8_t                stalled:1;    /* 1: Endpoint is stalled */
  uint8_t                isin:1;       /* 1: IN Endpoint */
  uint8_t                odd:1;        /* 1: Odd frame */
  uint8_t                zlp:1;        /* 1: Transmit a zero-length-packet (IN EPs only) */
};

/* This structure retains the state of the USB device controller */

struct nrf54l_usbdev_s
{
  /* Common device fields.  This must be the first thing defined in the
   * structure so that it is possible to simply cast from struct usbdev_s
   * to struct nrf54l_usbdev_s.
   */

  struct usbdev_s         usbdev;

  /* The bound device class driver */

  struct usbdevclass_driver_s *driver;

  struct work_s           vbuswork;
  bool                    initialized;
  bool                    active;
  bool                    connected;
  volatile bool           vbus_changed;

  /* NRF54L-specific fields */

  uint8_t                 stalled:1;     /* 1: Protocol stalled */
  uint8_t                 selfpowered:1; /* 1: Device is self powered */
  uint8_t                 addressed:1;   /* 1: Peripheral address has been set */
  uint8_t                 configured:1;  /* 1: Class driver has been configured */
  uint8_t                 wakeup:1;      /* 1: Device remote wake-up */
  uint8_t                 dotest:1;      /* 1: Test mode selected */

  uint8_t                 devstate:4;    /* See enum nrf54l_devstate_e */
  uint8_t                 ep0state:4;    /* See enum nrf54l_ep0state_e */
  uint8_t                 testmode:4;    /* Selected test mode */
  uint16_t                epavail[2];    /* Bitset of available OUT/IN endpoints */

  /* E0 SETUP data buffering.
   *
   * ctrlreq:
   *   The 8-byte SETUP request is received on the EP0 OUT endpoint and is
   *   saved.
   *
   * ep0data
   *   For OUT SETUP requests, the SETUP data phase must also complete before
   *   the SETUP command can be processed.  The pack receipt logic will save
   *   the accompanying EP0 IN data in ep0data[] before the SETUP command is
   *   processed.
   *
   *   For IN SETUP requests, the DATA phase will occur AFTER the SETUP
   *   control request is processed.  In that case, ep0data[] may be used as
   *   the response buffer.
   *
   * ep0datlen
   *   Length of OUT DATA received in ep0data[] (Not used with OUT data)
   */

  struct usb_ctrlreq_s    ctrlreq;
  uint8_t                 ep0data[CONFIG_USBDEV_SETUP_MAXDATASIZE];
  uint16_t                ep0datlen;

  /* The endpoint lists */

  struct nrf54l_ep_s       epin[NRF54L_NENDPOINTS];
  struct nrf54l_ep_s       epout[NRF54L_NENDPOINTS];
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* Register operations ******************************************************/

#if defined(CONFIG_NRF54L_USBDEV_REGDEBUG) && defined(CONFIG_DEBUG_FEATURES)
static uint32_t    nrf54l_getreg(uint32_t addr);
static void        nrf54l_putreg(uint32_t val, uint32_t addr);
#else
#  define nrf54l_getreg(addr)     getreg32(addr)
#  define nrf54l_putreg(val,addr) putreg32(val,addr)
#endif

/* Request queue operations *************************************************/

static struct nrf54l_req_s *nrf54l_req_remfirst(struct nrf54l_ep_s *privep);
static bool       nrf54l_req_addlast(struct nrf54l_ep_s *privep,
                    struct nrf54l_req_s *req);

/* Low level data transfers and request operations **************************/

/* Special endpoint 0 data transfer logic */

static int         nrf54l_ep0_mpsiz(uint16_t maxpacket);
static void        nrf54l_ep0in_setupresponse(struct nrf54l_usbdev_s *priv,
                     uint8_t *data, uint32_t nbytes);
static inline void nrf54l_ep0in_transmitzlp(struct nrf54l_usbdev_s *priv);
static void        nrf54l_ep0in_activate(void);

static void        nrf54l_ep0out_ctrlsetup(struct nrf54l_usbdev_s *priv);

/* IN request and TxFIFO handling */

static void        nrf54l_txfifo_write(struct nrf54l_ep_s *privep,
                     uint8_t *buf, int nbytes);
static void        nrf54l_epin_transfer(struct nrf54l_ep_s *privep,
                     uint8_t *buf, int nbytes);
static void        nrf54l_epin_request(struct nrf54l_usbdev_s *priv,
                     struct nrf54l_ep_s *privep);

/* OUT request and RxFIFO handling */

static void        nrf54l_rxfifo_read(struct nrf54l_ep_s *privep,
                     uint8_t *dest, uint16_t len);
static void        nrf54l_rxfifo_discard(struct nrf54l_ep_s *privep,
                                        int len);
static void        nrf54l_epout_complete(struct nrf54l_usbdev_s *priv,
                     struct nrf54l_ep_s *privep);
static inline void nrf54l_ep0out_receive(struct nrf54l_ep_s *privep,
                                        int bcnt);
static inline void nrf54l_epout_receive(struct nrf54l_ep_s *privep,
                                       int bcnt);
static void        nrf54l_epout_request(struct nrf54l_usbdev_s *priv,
                     struct nrf54l_ep_s *privep);

/* General request handling */

static void        nrf54l_ep_flush(struct nrf54l_ep_s *privep);
static void        nrf54l_req_complete(struct nrf54l_ep_s *privep,
                     int16_t result);
static void        nrf54l_req_cancel(struct nrf54l_ep_s *privep,
                     int16_t status);

