raiden00pl/nuttx/arch/arm/src/nrf54l/nrf54l_usbd.c
/* Interrupt handling *******************************************************/

static struct
nrf54l_ep_s *nrf54l_ep_findbyaddr(struct nrf54l_usbdev_s *priv,
                                uint16_t eplog);
static int         nrf54l_req_dispatch(struct nrf54l_usbdev_s *priv,
                     const struct usb_ctrlreq_s *ctrl);
static void        nrf54l_usbreset(struct nrf54l_usbdev_s *priv);

/* Second level OUT endpoint interrupt processing */

static inline void nrf54l_ep0out_testmode(struct nrf54l_usbdev_s *priv,
                     uint16_t index);
static inline void nrf54l_ep0out_stdrequest(struct nrf54l_usbdev_s *priv,
                     struct nrf54l_ctrlreq_s *ctrlreq);
static inline void nrf54l_ep0out_setup(struct nrf54l_usbdev_s *priv);
static inline void nrf54l_epout(struct nrf54l_usbdev_s *priv,
                     uint8_t epno);
static inline void nrf54l_epout_interrupt(struct nrf54l_usbdev_s *priv);

/* Second level IN endpoint interrupt processing */

static inline void nrf54l_epin_runtestmode(struct nrf54l_usbdev_s *priv);
static inline void nrf54l_epin(struct nrf54l_usbdev_s *priv, uint8_t epno);
static inline void nrf54l_epin_txfifoempty(struct nrf54l_usbdev_s *priv,
                     int epno);
static inline void nrf54l_epin_interrupt(struct nrf54l_usbdev_s *priv);

/* Other second level interrupt processing */

static inline void nrf54l_resumeinterrupt(struct nrf54l_usbdev_s *priv);
static inline void nrf54l_suspendinterrupt(struct nrf54l_usbdev_s *priv);
static inline void nrf54l_rxinterrupt(struct nrf54l_usbdev_s *priv);
static inline void nrf54l_enuminterrupt(struct nrf54l_usbdev_s *priv);
#ifdef CONFIG_USBDEV_ISOCHRONOUS
static inline void nrf54l_isocininterrupt(struct nrf54l_usbdev_s *priv);
static inline void nrf54l_isocoutinterrupt(struct nrf54l_usbdev_s *priv);
#endif

/* First level interrupt processing */

static int         nrf54l_usbinterrupt(int irq, void *context,
                                      void *arg);

/* Endpoint operations ******************************************************/

/* Global OUT NAK controls */

static void        nrf54l_enablegonak(struct nrf54l_ep_s *privep);
static void        nrf54l_disablegonak(struct nrf54l_ep_s *privep);

/* Endpoint configuration */

static int         nrf54l_epout_configure(struct nrf54l_ep_s *privep,
                     uint8_t eptype, uint16_t maxpacket);
static int         nrf54l_epin_configure(struct nrf54l_ep_s *privep,
                     uint8_t eptype, uint16_t maxpacket);
static int         nrf54l_ep_configure(struct usbdev_ep_s *ep,
                     const struct usb_epdesc_s *desc, bool last);
static void        nrf54l_ep0_configure(struct nrf54l_usbdev_s *priv);

/* Endpoint disable */

static void        nrf54l_epout_disable(struct nrf54l_ep_s *privep);
static void        nrf54l_epin_disable(struct nrf54l_ep_s *privep);
static int         nrf54l_ep_disable(struct usbdev_ep_s *ep);

/* Endpoint request management */

static struct usbdev_req_s *nrf54l_ep_allocreq(struct usbdev_ep_s *ep);
static void        nrf54l_ep_freereq(struct usbdev_ep_s *ep,
                     struct usbdev_req_s *);

/* Endpoint buffer management */

#ifdef CONFIG_USBDEV_DMA
static void       *nrf54l_ep_allocbuffer(struct usbdev_ep_s *ep,
                     unsigned bytes);
static void        nrf54l_ep_freebuffer(struct usbdev_ep_s *ep,
                     void *buf);
#endif

/* Endpoint request submission */

static int         nrf54l_ep_submit(struct usbdev_ep_s *ep,
                     struct usbdev_req_s *req);

/* Endpoint request cancellation */

static int         nrf54l_ep_cancel(struct usbdev_ep_s *ep,
                     struct usbdev_req_s *req);

/* Stall handling */

static int         nrf54l_epout_setstall(struct nrf54l_ep_s *privep);
static int         nrf54l_epin_setstall(struct nrf54l_ep_s *privep);
static int         nrf54l_ep_setstall(struct nrf54l_ep_s *privep);
static int         nrf54l_ep_clrstall(struct nrf54l_ep_s *privep);
static int         nrf54l_ep_stall(struct usbdev_ep_s *ep, bool resume);
static void        nrf54l_ep0_stall(struct nrf54l_usbdev_s *priv);

/* Endpoint allocation */

static struct usbdev_ep_s *nrf54l_ep_alloc(struct usbdev_s *dev,
                     uint8_t epno, bool in, uint8_t eptype);
static void        nrf54l_ep_free(struct usbdev_s *dev,
                     struct usbdev_ep_s *ep);

/* USB device controller operations *****************************************/

static int         nrf54l_getframe(struct usbdev_s *dev);
static int         nrf54l_wakeup(struct usbdev_s *dev);
static int         nrf54l_selfpowered(struct usbdev_s *dev,
                     bool selfpowered);
static int         nrf54l_pullup(struct usbdev_s *dev, bool enable);
static void        nrf54l_setaddress(struct nrf54l_usbdev_s *priv,
                     uint16_t address);
static int         nrf54l_txfifo_flush(uint32_t txfnum);
static int         nrf54l_rxfifo_flush(void);

/* Initialization ***********************************************************/

static void        nrf54l_swinitialize(struct nrf54l_usbdev_s *priv);
static int         nrf54l_hwinitialize(struct nrf54l_usbdev_s *priv);
static void        nrf54l_vbus_worker(void *arg);
static int         nrf54l_vbus_interrupt(int irq, void *context, void *arg);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* Since there is only a single USB interface, all status information can be
 * be simply retained in a single global instance.
 */

static struct nrf54l_usbdev_s g_usbdev;
static mutex_t g_usbdev_lock = NXMUTEX_INITIALIZER;

static const struct usbdev_epops_s g_epops =
{
  .configure   = nrf54l_ep_configure,
  .disable     = nrf54l_ep_disable,
  .allocreq    = nrf54l_ep_allocreq,
  .freereq     = nrf54l_ep_freereq,
#ifdef CONFIG_USBDEV_DMA
  .allocbuffer = nrf54l_ep_allocbuffer,
  .freebuffer  = nrf54l_ep_freebuffer,
#endif
  .submit      = nrf54l_ep_submit,
  .cancel      = nrf54l_ep_cancel,
  .stall       = nrf54l_ep_stall,
};

static const struct usbdev_ops_s g_devops =
{
  .allocep     = nrf54l_ep_alloc,
  .freeep      = nrf54l_ep_free,
  .getframe    = nrf54l_getframe,
  .wakeup      = nrf54l_wakeup,
  .selfpowered = nrf54l_selfpowered,
  .pullup      = nrf54l_pullup,
};

/* Device error strings that may be enabled for more descriptive USB trace
 * output.
 */

#ifdef CONFIG_USBDEV_TRACE_STRINGS
const struct trace_msg_t g_usb_trace_strings_deverror[] =
{
  TRACE_STR(NRF54L_TRACEERR_ALLOCFAIL),
  TRACE_STR(NRF54L_TRACEERR_BADCLEARFEATURE),
  TRACE_STR(NRF54L_TRACEERR_BADDEVGETSTATUS),
  TRACE_STR(NRF54L_TRACEERR_BADEPNO),
  TRACE_STR(NRF54L_TRACEERR_BADEPGETSTATUS),
  TRACE_STR(NRF54L_TRACEERR_BADGETCONFIG),
  TRACE_STR(NRF54L_TRACEERR_BADGETSETDESC),
  TRACE_STR(NRF54L_TRACEERR_BADGETSTATUS),
  TRACE_STR(NRF54L_TRACEERR_BADSETADDRESS),
  TRACE_STR(NRF54L_TRACEERR_BADSETCONFIG),
  TRACE_STR(NRF54L_TRACEERR_BADSETFEATURE),
  TRACE_STR(NRF54L_TRACEERR_BADTESTMODE),
  TRACE_STR(NRF54L_TRACEERR_BINDFAILED),
  TRACE_STR(NRF54L_TRACEERR_DISPATCHSTALL),
  TRACE_STR(NRF54L_TRACEERR_DRIVER),
  TRACE_STR(NRF54L_TRACEERR_DRIVERREGISTERED),
  TRACE_STR(NRF54L_TRACEERR_EP0NOSETUP),
  TRACE_STR(NRF54L_TRACEERR_EP0SETUPSTALLED),
  TRACE_STR(NRF54L_TRACEERR_EPINNULLPACKET),
  TRACE_STR(NRF54L_TRACEERR_EPINUNEXPECTED),
  TRACE_STR(NRF54L_TRACEERR_EPOUTNULLPACKET),
  TRACE_STR(NRF54L_TRACEERR_EPOUTUNEXPECTED),
  TRACE_STR(NRF54L_TRACEERR_INVALIDCTRLREQ),
  TRACE_STR(NRF54L_TRACEERR_INVALIDPARMS),
  TRACE_STR(NRF54L_TRACEERR_IRQREGISTRATION),
  TRACE_STR(NRF54L_TRACEERR_NOEP),
  TRACE_STR(NRF54L_TRACEERR_NOTCONFIGURED),
  TRACE_STR(NRF54L_TRACEERR_EPOUTQEMPTY),
  TRACE_STR(NRF54L_TRACEERR_EPINREQEMPTY),
  TRACE_STR(NRF54L_TRACEERR_NOOUTSETUP),
  TRACE_STR(NRF54L_TRACEERR_POLLTIMEOUT),
  TRACE_STR_END
};
#endif

/* Interrupt event strings that may be enabled for more descriptive USB trace
 * output.
 */

#ifdef CONFIG_USBDEV_TRACE_STRINGS
const struct trace_msg_t g_usb_trace_strings_intdecode[] =
{
  TRACE_STR(NRF54L_TRACEINTID_USB),
  TRACE_STR(NRF54L_TRACEINTID_INTPENDING),
  TRACE_STR(NRF54L_TRACEINTID_EPOUT),
  TRACE_STR(NRF54L_TRACEINTID_EPIN),
  TRACE_STR(NRF54L_TRACEINTID_MISMATCH),
  TRACE_STR(NRF54L_TRACEINTID_WAKEUP),
  TRACE_STR(NRF54L_TRACEINTID_SUSPEND),
  TRACE_STR(NRF54L_TRACEINTID_SOF),
  TRACE_STR(NRF54L_TRACEINTID_RXFIFO),
  TRACE_STR(NRF54L_TRACEINTID_DEVRESET),
  TRACE_STR(NRF54L_TRACEINTID_ENUMDNE),
  TRACE_STR(NRF54L_TRACEINTID_IISOIXFR),
  TRACE_STR(NRF54L_TRACEINTID_IISOOXFR),
  TRACE_STR(NRF54L_TRACEINTID_SRQ),
  TRACE_STR(NRF54L_TRACEINTID_OTG),
  TRACE_STR(NRF54L_TRACEINTID_EPOUT_XFRC),
  TRACE_STR(NRF54L_TRACEINTID_EPOUT_EPDISD),
  TRACE_STR(NRF54L_TRACEINTID_EPOUT_SETUP),
  TRACE_STR(NRF54L_TRACEINTID_DISPATCH),
  TRACE_STR(NRF54L_TRACEINTID_GETSTATUS),
  TRACE_STR(NRF54L_TRACEINTID_EPGETSTATUS),
  TRACE_STR(NRF54L_TRACEINTID_DEVGETSTATUS),
  TRACE_STR(NRF54L_TRACEINTID_IFGETSTATUS),
  TRACE_STR(NRF54L_TRACEINTID_CLEARFEATURE),
  TRACE_STR(NRF54L_TRACEINTID_SETFEATURE),
  TRACE_STR(NRF54L_TRACEINTID_SETADDRESS),
  TRACE_STR(NRF54L_TRACEINTID_GETSETDESC),
  TRACE_STR(NRF54L_TRACEINTID_GETCONFIG),
  TRACE_STR(NRF54L_TRACEINTID_SETCONFIG),
  TRACE_STR(NRF54L_TRACEINTID_GETSETIF),
  TRACE_STR(NRF54L_TRACEINTID_SYNCHFRAME),
  TRACE_STR(NRF54L_TRACEINTID_EPIN_XFRC),
  TRACE_STR(NRF54L_TRACEINTID_EPIN_TOC),
  TRACE_STR(NRF54L_TRACEINTID_EPIN_ITTXFE),
  TRACE_STR(NRF54L_TRACEINTID_EPIN_EPDISD),
  TRACE_STR(NRF54L_TRACEINTID_EPIN_TXFE),
  TRACE_STR(NRF54L_TRACEINTID_EPIN_EMPWAIT),
  TRACE_STR(NRF54L_TRACEINTID_OUTNAK),
  TRACE_STR(NRF54L_TRACEINTID_OUTRECVD),
  TRACE_STR(NRF54L_TRACEINTID_OUTDONE),
  TRACE_STR(NRF54L_TRACEINTID_SETUPDONE),
  TRACE_STR(NRF54L_TRACEINTID_SETUPRECVD),
  TRACE_STR_END
};
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: nrf54l_ready
 *
 * Description:
 *   Check whether core registers can be accessed. Call with interrupts
 *   disabled to serialize against the VBUS worker and regulator interrupt.
 *
 ****************************************************************************/

