raiden00pl/nuttx/arch/arm/src/nrf54l/nrf54l_usbd.c
static bool nrf54l_ready(struct nrf54l_usbdev_s *priv)
{
  return priv->active && !priv->vbus_changed && nrf54l_usbhs_vbus();
}

/****************************************************************************
 * Name: nrf54l_getreg
 *
 * Description:
 *   Get the contents of an NRF54L register
 *
 ****************************************************************************/

#if defined(CONFIG_NRF54L_USBDEV_REGDEBUG) && defined(CONFIG_DEBUG_FEATURES)
static uint32_t nrf54l_getreg(uint32_t addr)
{
  static uint32_t prevaddr = 0;
  static uint32_t preval = 0;
  static uint32_t count = 0;

  /* Read the value from the register */

  uint32_t val = getreg32(addr);

  /* Is this the same value that we read from the same register last time?
   * Are we polling the register?  If so, suppress some of the output.
   */

  if (addr == prevaddr && val == preval)
    {
      if (count == 0xffffffff || ++count > 3)
        {
          if (count == 4)
            {
              uinfo("...\n");
            }

          return val;
        }
    }

  /* No this is a new address or value */

  else
    {
      /* Did we print "..." for the previous value? */

      if (count > 3)
        {
          /* Yes.. then show how many times the value repeated */

          uinfo("[repeats %" PRId32 " more times]\n", count - 3);
        }

      /* Save the new address, value, and count */

      prevaddr = addr;
      preval   = val;
      count    = 1;
    }

  /* Show the register value read */

  uinfo("%08" PRIx32 "->%08" PRIx32 "\n", addr, val);
  return val;
}
#endif

/****************************************************************************
 * Name: nrf54l_putreg
 *
 * Description:
 *   Set the contents of an NRF54L register to a value
 *
 ****************************************************************************/

#if defined(CONFIG_NRF54L_USBDEV_REGDEBUG) && defined(CONFIG_DEBUG_FEATURES)
static void nrf54l_putreg(uint32_t val, uint32_t addr)
{
  /* Show the register value being written */

  uinfo("%08" PRIx32 "->%08" PRIx32 "\n", addr, val);

  /* Write the value */

  putreg32(val, addr);
}
#endif

/****************************************************************************
 * Name: nrf54l_req_remfirst
 *
 * Description:
 *   Remove a request from the head of an endpoint request queue
 *
 ****************************************************************************/

static struct nrf54l_req_s *nrf54l_req_remfirst(struct nrf54l_ep_s *privep)
{
  struct nrf54l_req_s *ret = privep->head;

  if (ret)
    {
      privep->head = ret->flink;
      if (!privep->head)
        {
          privep->tail = NULL;
        }

      ret->flink = NULL;
    }

  return ret;
}

/****************************************************************************
 * Name: nrf54l_req_addlast
 *
 * Description:
 *   Add a request to the end of an endpoint request queue
 *
 ****************************************************************************/

static bool nrf54l_req_addlast(struct nrf54l_ep_s *privep,
                              struct nrf54l_req_s *req)
{
  bool is_empty = !privep->head;

  req->flink = NULL;
  if (is_empty)
    {
      privep->head = req;
      privep->tail = req;
    }
  else
    {
      privep->tail->flink = req;
      privep->tail        = req;
    }

  return is_empty;
}

/****************************************************************************
 * Name: nrf54l_ep0in_setupresponse
 *
 * Description:
 *   Schedule a short transfer on Endpoint 0 (IN or OUT)
 *
 ****************************************************************************/

static void nrf54l_ep0in_setupresponse(struct nrf54l_usbdev_s *priv,
                                      uint8_t *buf, uint32_t nbytes)
{
  nrf54l_epin_transfer(&priv->epin[EP0], buf, nbytes);
  priv->ep0state = EP0STATE_SETUPRESPONSE;
  nrf54l_ep0out_ctrlsetup(priv);
}

/****************************************************************************
 * Name: nrf54l_ep0in_transmitzlp
 *
 * Description:
 *   Send a zero length packet (ZLP) on endpoint 0 IN
 *
 ****************************************************************************/

static inline void nrf54l_ep0in_transmitzlp(struct nrf54l_usbdev_s *priv)
{
  nrf54l_ep0in_setupresponse(priv, NULL, 0);
}

/****************************************************************************
 * Name: nrf54l_ep0_mpsiz
 *
 * Description:
 *   Encode the maximum packet size for either direction of endpoint 0.
 *
 ****************************************************************************/

static int nrf54l_ep0_mpsiz(uint16_t maxpacket)
{
  switch (maxpacket)
    {
      case 8:
        return OTG_DIEPCTL0_MPSIZ_8;

      case 16:
        return OTG_DIEPCTL0_MPSIZ_16;

      case 32:
        return OTG_DIEPCTL0_MPSIZ_32;

      case 64:
        return OTG_DIEPCTL0_MPSIZ_64;

      default:
        return -EINVAL;
    }
}

/****************************************************************************
 * Name: nrf54l_ep0in_activate
 *
 * Description:
 *   Activate the endpoint 0 IN endpoint.
 *
 ****************************************************************************/

static void nrf54l_ep0in_activate(void)
{
  uint32_t regval;

  /* Set the encoded maximum packet size of EP0 IN. */

  regval  = nrf54l_getreg(NRF54L_USBD_DIEPCTL(0));
  regval &= ~OTG_DIEPCTL0_MPSIZ_MASK;
  regval |= nrf54l_ep0_mpsiz(CONFIG_USBDEV_EP0_MAXSIZE);

  nrf54l_putreg(regval, NRF54L_USBD_DIEPCTL(0));

  /* Clear global IN NAK */

  regval  = nrf54l_getreg(NRF54L_USBD_DCTL);
  regval |= OTG_DCTL_CGINAK;
  nrf54l_putreg(regval, NRF54L_USBD_DCTL);
}

/****************************************************************************
 * Name: nrf54l_ep0out_ctrlsetup
 *
 * Description:
 *   Setup to receive a SETUP packet.
 *
 ****************************************************************************/

static void nrf54l_ep0out_ctrlsetup(struct nrf54l_usbdev_s *priv)
{
  uint32_t regval;

  /* Setup the hardware to perform the SETUP transfer */

  regval = (USB_SIZEOF_CTRLREQ * 3 << OTG_DOEPTSIZ0_XFRSIZ_SHIFT) |
           (OTG_DOEPTSIZ0_PKTCNT) |
           (3 << OTG_DOEPTSIZ0_STUPCNT_SHIFT);
  nrf54l_putreg(regval, NRF54L_USBD_DOEPTSIZ(0));

