raiden00pl/nuttx/arch/arm/src/nrf54l/nrf54l_usbd.c
  if (privep->epphy == EP0)
    {
      privep->stalled = privep->dev->stalled;
    }

  /* Save the result in the request structure */

  privreq->req.result = result;

  /* Callback to the request completion handler */

  privreq->req.callback(&privep->ep, &privreq->req);

  /* Restore the stalled indication */

  privep->stalled = stalled;
}

/****************************************************************************
 * Name: nrf54l_req_cancel
 *
 * Description:
 *   Cancel all pending requests for an endpoint
 *
 ****************************************************************************/

static void nrf54l_req_cancel(struct nrf54l_ep_s *privep, int16_t status)
{
  if (!nrf54l_rqempty(privep) && nrf54l_ready(privep->dev))
    {
      nrf54l_ep_flush(privep);
    }

  while (!nrf54l_rqempty(privep))
    {
      usbtrace(TRACE_COMPLETE(privep->epphy),
               (nrf54l_rqpeek(privep))->req.xfrd);
      nrf54l_req_complete(privep, status);
    }
}

/****************************************************************************
 * Name: nrf54l_ep_findbyaddr
 *
 * Description:
 *   Find the physical endpoint structure corresponding to a logic endpoint
 *   address
 *
 ****************************************************************************/

static struct nrf54l_ep_s *nrf54l_ep_findbyaddr(struct nrf54l_usbdev_s *priv,
                                              uint16_t eplog)
{
  struct nrf54l_ep_s *privep;
  uint8_t epphy = USB_EPNO(eplog);

  if (epphy >= NRF54L_NENDPOINTS)
    {
      return NULL;
    }

  /* Is this an IN or an OUT endpoint? */

  if (USB_ISEPIN(eplog))
    {
      privep = &priv->epin[epphy];
    }
  else
    {
      privep = &priv->epout[epphy];
    }

  /* Return endpoint reference */

  DEBUGASSERT(privep->epphy == epphy);
  return privep;
}

/****************************************************************************
 * Name: nrf54l_req_dispatch
 *
 * Description:
 *   Provide unhandled setup actions to the class driver. This is logically
 *   part of the USB interrupt handler.
 *
 ****************************************************************************/

static int nrf54l_req_dispatch(struct nrf54l_usbdev_s *priv,
                              const struct usb_ctrlreq_s *ctrl)
{
  int ret = -EIO;

  usbtrace(TRACE_INTDECODE(NRF54L_TRACEINTID_DISPATCH), 0);
  if (priv->driver)
    {
      /* Forward to the control request to the class driver implementation */

      ret = CLASS_SETUP(priv->driver, &priv->usbdev, ctrl,
                        priv->ep0data, priv->ep0datlen);
    }

  if (ret < 0)
    {
      /* Stall on failure */

      usbtrace(TRACE_DEVERROR(NRF54L_TRACEERR_DISPATCHSTALL), 0);
      priv->stalled = true;
    }

  return ret;
}

/****************************************************************************
 * Name: nrf54l_usbreset
 *
 * Description:
 *   Reset Usb engine
 *
 ****************************************************************************/

static void nrf54l_usbreset(struct nrf54l_usbdev_s *priv)
{
  struct nrf54l_ep_s *privep;
  uint32_t regval;
  int i;

  /* Clear the Remote Wake-up Signaling */

  regval = nrf54l_getreg(NRF54L_USBD_DCTL);
  regval &= ~OTG_DCTL_RWUSIG;
  nrf54l_putreg(regval, NRF54L_USBD_DCTL);

  /* Flush the EP0 Tx FIFO */

  nrf54l_txfifo_flush(OTG_GRSTCTL_TXFNUM_D(EP0));

  /* Tell the class driver that we are disconnected. The class
   * driver should then accept any new configurations.
   */

  if (priv->driver)
    {
      CLASS_DISCONNECT(priv->driver, &priv->usbdev);
    }

  /* Mark all endpoints as available */

  priv->epavail[0] = NRF54L_EP_AVAILABLE;
  priv->epavail[1] = NRF54L_EP_AVAILABLE;

  /* Disable all end point interrupts */

  for (i = 0; i < NRF54L_NENDPOINTS ; i++)
    {
      /* Disable endpoint interrupts */

      nrf54l_putreg(0xff, NRF54L_USBD_DIEPINT(i));
      nrf54l_putreg(0xff, NRF54L_USBD_DOEPINT(i));

      /* Return write requests to the class implementation */

      privep = &priv->epin[i];
      nrf54l_req_cancel(privep, -ESHUTDOWN);

      /* Reset IN endpoint status */

      privep->stalled = false;
      privep->active  = false;
      privep->zlp     = false;

      /* Return read requests to the class implementation */

      privep = &priv->epout[i];
      nrf54l_req_cancel(privep, -ESHUTDOWN);

      /* Reset endpoint status */

      privep->stalled = false;
      privep->active  = false;
      privep->zlp     = false;
    }

  nrf54l_putreg(0xffffffff, NRF54L_USBD_DAINT);

  /* Mask all device endpoint interrupts except EP0 */

  regval = (OTG_DAINT_IEP(EP0) | OTG_DAINT_OEP(EP0));
  nrf54l_putreg(regval, NRF54L_USBD_DAINTMSK);

  /* Unmask OUT interrupts */

  regval = (OTG_DOEPMSK_XFRCM | OTG_DOEPMSK_STUPM | OTG_DOEPMSK_EPDM);
  nrf54l_putreg(regval, NRF54L_USBD_DOEPMSK);

  /* Unmask IN interrupts */

  regval = (OTG_DIEPMSK_XFRCM | OTG_DIEPMSK_EPDM | OTG_DIEPMSK_TOM);
  nrf54l_putreg(regval, NRF54L_USBD_DIEPMSK);

  /* Reset device address to 0 */

  nrf54l_setaddress(priv, 0);
  priv->devstate = DEVSTATE_DEFAULT;
  priv->usbdev.speed = USB_SPEED_UNKNOWN;

  /* Re-configure EP0 */

  nrf54l_ep0_configure(priv);

  /* Setup EP0 to receive SETUP packets */

  nrf54l_ep0out_ctrlsetup(priv);
}

/****************************************************************************
 * Name: nrf54l_ep0out_testmode
 *
 * Description:
 *   Select test mode
 *
 ****************************************************************************/

static inline void nrf54l_ep0out_testmode(struct nrf54l_usbdev_s *priv,
                                         uint16_t index)
{
  uint8_t testmode;

  testmode = index >> 8;
  switch (testmode)
    {
      case 1:
        priv->testmode = OTG_TESTMODE_J;
        break;

      case 2:
        priv->testmode = OTG_TESTMODE_K;
        break;

      case 3:
        priv->testmode = OTG_TESTMODE_SE0_NAK;
        break;

      case 4:
        priv->testmode = OTG_TESTMODE_PACKET;
        break;

      case 5:
        priv->testmode = OTG_TESTMODE_FORCE;
        break;

      default:
        usbtrace(TRACE_DEVERROR(NRF54L_TRACEERR_BADTESTMODE), testmode);
        priv->dotest   = false;
        priv->testmode = OTG_TESTMODE_DISABLED;
        priv->stalled  = true;
    }

  priv->dotest = true;
  nrf54l_ep0in_transmitzlp(priv);
}

/****************************************************************************
 * Name: nrf54l_ep0out_stdrequest
 *
 * Description:
 *   Handle a standard request on EP0.  Pick off the things of interest to
 *   the USB device controller driver; pass what is left to the class driver.
 *
 ****************************************************************************/

static inline
void nrf54l_ep0out_stdrequest(struct nrf54l_usbdev_s *priv,
                             struct nrf54l_ctrlreq_s *ctrlreq)
{
  struct nrf54l_ep_s *privep;

  /* Handle standard request */

  switch (ctrlreq->req)
    {
      case USB_REQ_GETSTATUS:
        {
          /* type:  device-to-host; recipient = device, interface, endpoint
           * value: 0
           * index: zero interface endpoint
           * len:   2; data = status
           */

