raiden00pl/nuttx/arch/arm/src/nrf54l/nrf54l_usbd.c
          usbtrace(TRACE_INTDECODE(NRF54L_TRACEINTID_GETSTATUS), 0);
          if (!priv->addressed ||
               ctrlreq->len != 2 ||
              USB_REQ_ISOUT(ctrlreq->type) ||
              ctrlreq->value != 0)
            {
              priv->stalled = true;
            }
          else
            {
              switch (ctrlreq->type & USB_REQ_RECIPIENT_MASK)
                {
                  case USB_REQ_RECIPIENT_ENDPOINT:
                    {
                      usbtrace(TRACE_INTDECODE(
                               NRF54L_TRACEINTID_EPGETSTATUS), 0);
                      privep = nrf54l_ep_findbyaddr(priv, ctrlreq->index);
                      if (!privep)
                        {
                          usbtrace(TRACE_DEVERROR(
                                   NRF54L_TRACEERR_BADEPGETSTATUS), 0);
                          priv->stalled = true;
                        }
                      else
                        {
                          if (privep->stalled)
                            {
                              priv->ep0data[0] =
                                (1 << USB_FEATURE_ENDPOINTHALT);
                            }
                          else
                            {
                              priv->ep0data[0] = 0; /* Not stalled */
                            }

                          priv->ep0data[1] = 0;
                          nrf54l_ep0in_setupresponse(priv, priv->ep0data, 2);
                        }
                    }
                    break;

                  case USB_REQ_RECIPIENT_DEVICE:
                    {
                      if (ctrlreq->index == 0)
                        {
                          usbtrace(TRACE_INTDECODE(
                                   NRF54L_TRACEINTID_DEVGETSTATUS), 0);

                          /* Features:  Remote Wakeup and self-powered */

                          priv->ep0data[0]  = (priv->selfpowered <<
                                               USB_FEATURE_SELFPOWERED);
                          priv->ep0data[0] |= (priv->wakeup      <<
                                               USB_FEATURE_REMOTEWAKEUP);
                          priv->ep0data[1]  = 0;

                          nrf54l_ep0in_setupresponse(priv, priv->ep0data, 2);
                        }
                      else
                        {
                          usbtrace(TRACE_DEVERROR(
                                   NRF54L_TRACEERR_BADDEVGETSTATUS), 0);
                          priv->stalled = true;
                        }
                    }

                    break;

                  case USB_REQ_RECIPIENT_INTERFACE:
                    {
                      usbtrace(TRACE_INTDECODE(
                               NRF54L_TRACEINTID_IFGETSTATUS), 0);
                      priv->ep0data[0] = 0;
                      priv->ep0data[1] = 0;

                      nrf54l_ep0in_setupresponse(priv, priv->ep0data, 2);
                    }
                    break;

                  default:
                    {
                      usbtrace(TRACE_DEVERROR(NRF54L_TRACEERR_BADGETSTATUS),
                               0);
                      priv->stalled = true;
                    }
                    break;
                }
            }
        }
        break;

      case USB_REQ_CLEARFEATURE:
        {
          /* type:  host-to-device; recipient = device, interface or endpoint
           * value: feature selector
           * index: zero interface endpoint;
           * len:   zero, data = none
           */

          usbtrace(TRACE_INTDECODE(NRF54L_TRACEINTID_CLEARFEATURE), 0);
          if (priv->addressed != 0 && ctrlreq->len == 0)
            {
              uint8_t recipient = ctrlreq->type & USB_REQ_RECIPIENT_MASK;

              if (recipient == USB_REQ_RECIPIENT_ENDPOINT &&
                  ctrlreq->value == USB_FEATURE_ENDPOINTHALT &&
                  (privep = nrf54l_ep_findbyaddr(priv,
                                                ctrlreq->index)) != NULL)
                {
                  nrf54l_ep_clrstall(privep);
                  nrf54l_ep0in_transmitzlp(priv);
                }
              else if (recipient == USB_REQ_RECIPIENT_DEVICE &&
                       ctrlreq->value == USB_FEATURE_REMOTEWAKEUP)
                {
                  priv->wakeup = 0;
                  nrf54l_ep0in_transmitzlp(priv);
                }
              else
                {
                  /* Actually, I think we could just stall here. */

                  nrf54l_req_dispatch(priv, &priv->ctrlreq);
                }
            }
          else
            {
              usbtrace(TRACE_DEVERROR(NRF54L_TRACEERR_BADCLEARFEATURE), 0);
              priv->stalled = true;
            }
        }
        break;

      case USB_REQ_SETFEATURE:
        {
          /* type:  host-to-device; recipient = device, interface, endpoint
           * value: feature selector
           * index: zero interface endpoint;
           * len:   0; data = none
           */

          usbtrace(TRACE_INTDECODE(NRF54L_TRACEINTID_SETFEATURE), 0);
          if (priv->addressed != 0 && ctrlreq->len == 0)
            {
              uint8_t recipient = ctrlreq->type & USB_REQ_RECIPIENT_MASK;

              if (recipient == USB_REQ_RECIPIENT_ENDPOINT &&
                  ctrlreq->value == USB_FEATURE_ENDPOINTHALT &&
                  (privep = nrf54l_ep_findbyaddr(priv,
                                                ctrlreq->index)) != NULL)
                {
                  nrf54l_ep_setstall(privep);
                  nrf54l_ep0in_transmitzlp(priv);
                }
              else if (recipient == USB_REQ_RECIPIENT_DEVICE &&
                       ctrlreq->value == USB_FEATURE_REMOTEWAKEUP)
                {
                  priv->wakeup = 1;
                  nrf54l_ep0in_transmitzlp(priv);
                }
              else if (recipient == USB_REQ_RECIPIENT_DEVICE &&
                       ctrlreq->value == USB_FEATURE_TESTMODE &&
                       ((ctrlreq->index & 0xff) == 0))
                {
                  nrf54l_ep0out_testmode(priv, ctrlreq->index);
                }
              else if (priv->configured)
                {
                  /* Actually, I think we could just stall here. */

                  nrf54l_req_dispatch(priv, &priv->ctrlreq);
                }
              else
                {
                  usbtrace(TRACE_DEVERROR(NRF54L_TRACEERR_BADSETFEATURE), 0);
                  priv->stalled = true;
                }
            }
          else
            {
              usbtrace(TRACE_DEVERROR(NRF54L_TRACEERR_BADSETFEATURE), 0);
              priv->stalled = true;
            }
        }

        break;

