raiden00pl/nuttx/arch/arm/src/nrf54l/nrf54l_usbd.c
      case USB_REQ_SETADDRESS:
        {
          /* type:  host-to-device; recipient = device
           * value: device address
           * index: 0
           * len:   0; data = none
           */

          usbtrace(TRACE_INTDECODE(NRF54L_TRACEINTID_SETADDRESS),
                    ctrlreq->value);
          if ((ctrlreq->type & USB_REQ_RECIPIENT_MASK) ==
              USB_REQ_RECIPIENT_DEVICE &&
              ctrlreq->index  == 0 &&
              ctrlreq->len == 0 &&
              ctrlreq->value < 128 &&
              priv->devstate != DEVSTATE_CONFIGURED)
            {
              /* Save the address.
               * We cannot actually change to the next address until
               * the completion of the status phase.
               */

              nrf54l_setaddress(priv, (uint16_t)priv->ctrlreq.value[0]);
              nrf54l_ep0in_transmitzlp(priv);
            }
          else
            {
              usbtrace(TRACE_DEVERROR(NRF54L_TRACEERR_BADSETADDRESS), 0);
              priv->stalled = true;
            }
        }
        break;

      case USB_REQ_GETDESCRIPTOR:
        /* type:  device-to-host; recipient = device
         * value: descriptor type and index
         * index: 0 or language ID;
         * len:   descriptor len; data = descriptor
         */

      case USB_REQ_SETDESCRIPTOR:
        /* type:  host-to-device; recipient = device
         * value: descriptor type and index
         * index: 0 or language ID;
         * len:   descriptor len; data = descriptor
         */

        {
          usbtrace(TRACE_INTDECODE(NRF54L_TRACEINTID_GETSETDESC), 0);
          if ((ctrlreq->type & USB_REQ_RECIPIENT_MASK) ==
               USB_REQ_RECIPIENT_DEVICE)
            {
              nrf54l_req_dispatch(priv, &priv->ctrlreq);
            }
          else
            {
              usbtrace(TRACE_DEVERROR(NRF54L_TRACEERR_BADGETSETDESC), 0);
              priv->stalled = true;
            }
        }
        break;

      case USB_REQ_GETCONFIGURATION:
        /* type:  device-to-host; recipient = device
         * value: 0;
         * index: 0;
         * len:   1; data = configuration value
         */

        {
          usbtrace(TRACE_INTDECODE(NRF54L_TRACEINTID_GETCONFIG), 0);
          if (priv->addressed &&
             (ctrlreq->type & USB_REQ_RECIPIENT_MASK) ==
              USB_REQ_RECIPIENT_DEVICE &&
              ctrlreq->value == 0 &&
              ctrlreq->index == 0 &&
              ctrlreq->len == 1)
            {
              nrf54l_req_dispatch(priv, &priv->ctrlreq);
            }
          else
            {
              usbtrace(TRACE_DEVERROR(NRF54L_TRACEERR_BADGETCONFIG), 0);
              priv->stalled = true;
            }
        }
        break;

      case USB_REQ_SETCONFIGURATION:
        /* type:  host-to-device; recipient = device
         * value: configuration value
         * index: 0;
         * len:   0; data = none
         */

        {
          usbtrace(TRACE_INTDECODE(NRF54L_TRACEINTID_SETCONFIG), 0);
          if (priv->addressed &&
              (ctrlreq->type & USB_REQ_RECIPIENT_MASK) ==
               USB_REQ_RECIPIENT_DEVICE &&
               ctrlreq->index == 0 &&
               ctrlreq->len == 0)
            {
              /* Give the configuration to the class driver */

              int ret = nrf54l_req_dispatch(priv, &priv->ctrlreq);

              /* If the class driver accepted the configuration, then mark
               * the device state as configured (or not, depending on the
               * configuration).
               */

              if (ret == OK)
                {
                  uint8_t cfg = (uint8_t)ctrlreq->value;

                  if (cfg != 0)
                    {
                      priv->devstate   = DEVSTATE_CONFIGURED;
                      priv->configured = true;
                    }
                  else
                    {
                      priv->devstate   = DEVSTATE_ADDRESSED;
                      priv->configured = false;
                    }
                }
            }
          else
            {
              usbtrace(TRACE_DEVERROR(NRF54L_TRACEERR_BADSETCONFIG), 0);
              priv->stalled = true;
            }
        }
        break;

      case USB_REQ_GETINTERFACE:
        /* type:  device-to-host; recipient = interface
         * value: 0
         * index: interface;
         * len:   1; data = alt interface
         */

      case USB_REQ_SETINTERFACE:
        /* type:  host-to-device; recipient = interface
         * value: alternate setting
         * index: interface;
         * len:   0; data = none
         */

        {
          usbtrace(TRACE_INTDECODE(NRF54L_TRACEINTID_GETSETIF), 0);
          nrf54l_req_dispatch(priv, &priv->ctrlreq);
        }
        break;

      case USB_REQ_SYNCHFRAME:
        /* type:  device-to-host; recipient = endpoint
         * value: 0
         * index: endpoint;
         * len:   2; data = frame number
         */

        {
          usbtrace(TRACE_INTDECODE(NRF54L_TRACEINTID_SYNCHFRAME), 0);
        }
        break;

      default:
        {
          usbtrace(TRACE_DEVERROR(NRF54L_TRACEERR_INVALIDCTRLREQ), 0);
          priv->stalled = true;
        }
        break;
    }
}

/****************************************************************************
 * Name: nrf54l_ep0out_setup
 *
 * Description:
 *   USB Ctrl EP Setup Event. This is logically part of the USB interrupt
 *   handler.  This event occurs when a setup packet is receive on EP0 OUT.
 *
 ****************************************************************************/

static inline void nrf54l_ep0out_setup(struct nrf54l_usbdev_s *priv)
{
  struct nrf54l_ctrlreq_s ctrlreq;

  /* Verify that a SETUP was received */

  if (priv->ep0state != EP0STATE_SETUP_READY)
    {
      usbtrace(TRACE_DEVERROR(NRF54L_TRACEERR_EP0NOSETUP), priv->ep0state);
      return;
    }

  /* Terminate any pending requests */

  nrf54l_req_cancel(&priv->epout[EP0], -EPROTO);
  nrf54l_req_cancel(&priv->epin[EP0],  -EPROTO);

  /* Assume NOT stalled */

  priv->epout[EP0].stalled = false;
  priv->epin[EP0].stalled = false;
  priv->stalled = false;

  /* Starting to process a control request - update state */

