raiden00pl/nuttx/arch/arm/src/nrf54l/nrf54l_usbd.c
          if ((diepint & OTG_DIEPINT_XFRC) != 0)
            {
              usbtrace(TRACE_INTDECODE(NRF54L_TRACEINTID_EPIN_XFRC),
                       (uint16_t)diepint);

              /* It is possible that logic may be waiting for a the
               * TxFIFO to become empty.  We disable the TxFIFO empty
               * interrupt here; it will be re-enabled if there is still
               * insufficient space in the TxFIFO.
               */

              empty &= ~OTG_DIEPEMPMSK(epno);
              nrf54l_putreg(empty, NRF54L_USBD_DIEPEMPMSK);
              nrf54l_putreg(OTG_DIEPINT_XFRC, NRF54L_USBD_DIEPINT(epno));

              /* IN transfer complete */

              nrf54l_epin(priv, epno);
            }

          /* Timeout condition */

          if ((diepint & OTG_DIEPINT_TOC) != 0)
            {
              usbtrace(TRACE_INTDECODE(NRF54L_TRACEINTID_EPIN_TOC),
                      (uint16_t)diepint);
              nrf54l_putreg(OTG_DIEPINT_TOC, NRF54L_USBD_DIEPINT(epno));
            }

          /* IN token received when TxFIFO is empty.  Applies to non-periodic
           * IN endpoints only.  This interrupt indicates that an IN token
           * was received when the associated TxFIFO (periodic/non-periodic)
           * was empty. This interrupt is asserted on the endpoint for which
           * the IN token was received.
           */

          if ((diepint & OTG_DIEPINT_ITTXFE) != 0)
            {
              usbtrace(TRACE_INTDECODE(NRF54L_TRACEINTID_EPIN_ITTXFE),
                      (uint16_t)diepint);
              nrf54l_epin_request(priv, &priv->epin[epno]);
              nrf54l_putreg(OTG_DIEPINT_ITTXFE, NRF54L_USBD_DIEPINT(epno));
            }

          /* IN endpoint NAK effective (ignored as this used only in polled
           * mode)
           */
#if 0
          if ((diepint & OTG_DIEPINT_INEPNE) != 0)
            {
              usbtrace(TRACE_INTDECODE(NRF54L_TRACEINTID_EPIN_INEPNE),
                      (uint16_t)diepint);
              nrf54l_putreg(OTG_DIEPINT_INEPNE, NRF54L_USBD_DIEPINT(epno));
            }
#endif

          /* Endpoint disabled interrupt (ignored as this used only in polled
           * mode)
           */
#if 0
          if ((diepint & OTG_DIEPINT_EPDISD) != 0)
            {
              usbtrace(TRACE_INTDECODE(NRF54L_TRACEINTID_EPIN_EPDISD),
                      (uint16_t)diepint);
              nrf54l_putreg(OTG_DIEPINT_EPDISD, NRF54L_USBD_DIEPINT(epno));
            }
#endif

          /* Transmit FIFO empty */

          if ((diepint & OTG_DIEPINT_TXFE) != 0)
            {
              usbtrace(TRACE_INTDECODE(NRF54L_TRACEINTID_EPIN_TXFE),
                      (uint16_t)diepint);

              /* If we were waiting for TxFIFO to become empty, the we might
               * have both XFRC and TXFE interrupts pending.  Since we do the
               * same thing for both cases, ignore the TXFE if we have
               * already processed the XFRC.
               */

              if ((diepint & OTG_DIEPINT_XFRC) == 0)
                {
                  /* Mask further FIFO empty interrupts.
                   * This will be re-enabled whenever we need to wait for a
                   * FIFO event.
                   */

                  empty &= ~OTG_DIEPEMPMSK(epno);
                  nrf54l_putreg(empty, NRF54L_USBD_DIEPEMPMSK);

                  /* Handle TxFIFO empty */

                  nrf54l_epin_txfifoempty(priv, epno);
                }

              /* Clear the pending TxFIFO empty interrupt */

              nrf54l_putreg(OTG_DIEPINT_TXFE, NRF54L_USBD_DIEPINT(epno));
            }
        }

      epno++;
      daint >>= 1;
    }
}

/****************************************************************************
 * Name: nrf54l_resumeinterrupt
 *
 * Description:
 *   Resume/remote wakeup detected interrupt
 *
 ****************************************************************************/

static inline void nrf54l_resumeinterrupt(struct nrf54l_usbdev_s *priv)
{
  uint32_t regval;

  /* Clear remote wake-up signaling */

  regval  = nrf54l_getreg(NRF54L_USBD_DCTL);
  regval &= ~OTG_DCTL_RWUSIG;
  nrf54l_putreg(regval, NRF54L_USBD_DCTL);

  /* Notify the class driver of the resume event */

  if (priv->driver)
    {
      CLASS_RESUME(priv->driver, &priv->usbdev);
    }
}

/****************************************************************************
 * Name: nrf54l_suspendinterrupt
 *
 * Description:
 *   USB suspend interrupt
 *
 ****************************************************************************/

static inline void nrf54l_suspendinterrupt(struct nrf54l_usbdev_s *priv)
{
  /* Notify the class driver of the suspend event */

  if (priv->driver)
    {
      CLASS_SUSPEND(priv->driver, &priv->usbdev);
    }
}

/****************************************************************************
 * Name: nrf54l_rxinterrupt
 *
 * Description:
 *   RxFIFO non-empty interrupt.  This interrupt indicates that there is at
 *   least one packet pending to be read from the RxFIFO.
 *
 ****************************************************************************/

static inline void nrf54l_rxinterrupt(struct nrf54l_usbdev_s *priv)
{
  struct nrf54l_ep_s *privep;
  uint32_t regval;
  int bcnt;
  int epphy;

  /* Get the status from the top of the FIFO */

  regval = nrf54l_getreg(NRF54L_USBD_GRXSTSP);

  /* Decode status fields */

  epphy  = (regval & OTG_GRXSTSD_EPNUM_MASK) >> OTG_GRXSTSD_EPNUM_SHIFT;

  if (epphy < NRF54L_NENDPOINTS)
    {
      privep = &priv->epout[epphy];

      /* Handle the RX event according to the packet status field */

      switch (regval & OTG_GRXSTSD_PKTSTS_MASK)
        {
          /* Global OUT NAK.
           * This indicate that the global OUT NAK bit
           * has taken effect.
           *
           * PKTSTS = Global OUT NAK, BCNT = 0, EPNUM = Don't Care,
           *  DPID = Don'tCare.
           */

          case OTG_GRXSTSD_PKTSTS_OUTNAK:
            {
              usbtrace(TRACE_INTDECODE(NRF54L_TRACEINTID_OUTNAK), 0);
            }
            break;

          /* OUT data packet received.
           *
           * PKTSTS = DataOUT, BCNT = size of the received data OUT packet,
           * EPNUM = EPNUM on which the packet was received,
           *          DPID = Actual Data PID.
           */

