raiden00pl/nuttx/arch/arm/src/nrf54l/nrf54l_usbd.c
          case OTG_GRXSTSD_PKTSTS_OUTRECVD:
            {
              usbtrace(TRACE_INTDECODE(NRF54L_TRACEINTID_OUTRECVD), epphy);
              bcnt = (regval & OTG_GRXSTSD_BCNT_MASK) >>
                      OTG_GRXSTSD_BCNT_SHIFT;
              if (bcnt > 0)
                {
                  nrf54l_epout_receive(privep, bcnt);
                }
            }
            break;

          /* OUT transfer completed.
           * This indicates that an OUT data transfer for the specified OUT
           * endpoint has completed. After this entry is popped from the
           *  receive FIFO, the core asserts a Transfer Completed interrupt
           * on the specified OUT endpoint.
           *
           * PKTSTS = Data OUT Transfer Done, BCNT = 0, EPNUM = OUT EP Num on
           * which the data transfer is complete, DPID = Don't Care.
           */

          case OTG_GRXSTSD_PKTSTS_OUTDONE:
            {
              usbtrace(TRACE_INTDECODE(NRF54L_TRACEINTID_OUTDONE), epphy);
            }
            break;

          /* SETUP transaction completed.  This indicates that the Setup
           * stage for the specified endpoint has completed and the Data
           * stage has started.  After this entry is popped from the receive
           * FIFO, the core asserts a Setup interrupt on the specified
           * control OUT endpoint (triggers an interrupt).
           *
           * PKTSTS = Setup Stage Done, BCNT = 0, EPNUM = Control EP Num,
           * DPID = Don't Care.
           */

          case OTG_GRXSTSD_PKTSTS_SETUPDONE:
            {
              usbtrace(TRACE_INTDECODE(NRF54L_TRACEINTID_SETUPDONE), epphy);

              /* Now that the Setup Phase is complete if it was an OUT enable
               * the endpoint
               * (Doing this here prevents the loss of the first FIFO word)
               */

              if (priv->ep0state == EP0STATE_SETUP_OUT)
                {
                  /* Clear NAKSTS so that we can receive the data */

                  regval  = nrf54l_getreg(NRF54L_USBD_DOEPCTL(0));
                  regval |= OTG_DOEPCTL0_CNAK;
                  nrf54l_putreg(regval, NRF54L_USBD_DOEPCTL(0));
                }
            }
            break;

          /* SETUP data packet received.  This indicates that a SETUP packet
           * for the specified endpoint is now available for reading from the
           * receive FIFO.
           *
           * PKTSTS = SETUP, BCNT = 8, EPNUM = Control EP Num, DPID = D0.
           */

          case OTG_GRXSTSD_PKTSTS_SETUPRECVD:
            {
              uint16_t datlen;

              usbtrace(TRACE_INTDECODE(NRF54L_TRACEINTID_SETUPRECVD), epphy);

              /* Read EP0 setup data.
               * NOTE:  If multiple SETUP packets are received, the last one
               * overwrites the previous setup packets and only that last
               * SETUP packet will be processed.
               */

              nrf54l_rxfifo_read(&priv->epout[EP0],
                               (uint8_t *)&priv->ctrlreq,
                                USB_SIZEOF_CTRLREQ);

              /* Was this an IN or an OUT SETUP packet.  If it is an OUT
               * SETUP, then we need to wait for the completion of the data
               * phase to process the setup command.  If it is an IN SETUP
               * packet, then we must processing the command BEFORE we enter
               * the DATA phase.
               *
               * If the data associated with the OUT SETUP packet is zero
               * length, then, of course, we don't need to wait.
               */

              datlen = GETUINT16(priv->ctrlreq.len);
              if (USB_REQ_ISOUT(priv->ctrlreq.type) && datlen > 0)
                {
                  priv->ep0state = EP0STATE_SETUP_OUT;
                }
              else
                {
                  /* We can process the setup data as soon as SETUP done word
                   * is popped of the RxFIFO.
                   */

                  priv->ep0state = EP0STATE_SETUP_READY;
                }
            }
            break;

          default:
            {
              usbtrace(TRACE_DEVERROR(NRF54L_TRACEERR_INVALIDPARMS),
                       (regval & OTG_GRXSTSD_PKTSTS_MASK) >>
                        OTG_GRXSTSD_PKTSTS_SHIFT);
            }
            break;
        }
    }
}

/****************************************************************************
 * Name: nrf54l_enuminterrupt
 *
 * Description:
 *   Enumeration done interrupt
 *
 ****************************************************************************/

static inline void nrf54l_enuminterrupt(struct nrf54l_usbdev_s *priv)
{
  uint32_t regval;

  regval = nrf54l_getreg(NRF54L_USBD_DSTS) & OTG_DSTS_ENUMSPD_MASK;
  priv->usbdev.speed = regval == OTG_DSTS_ENUMSPD_HS ? USB_SPEED_HIGH :
                        USB_SPEED_FULL;

  /* Activate EP0 */

  nrf54l_ep0in_activate();

  /* Set USB turn-around time for the 16-bit UTMI+ PHY interface. */

  regval  = nrf54l_getreg(NRF54L_USBD_GUSBCFG);
  regval &= ~OTG_GUSBCFG_TRDT_MASK;
  regval |= OTG_GUSBCFG_TRDT(5);
  nrf54l_putreg(regval, NRF54L_USBD_GUSBCFG);
}

/****************************************************************************
 * Name: nrf54l_isocininterrupt
 *
 * Description:
 *   Incomplete isochronous IN transfer interrupt.  Assertion of the
 *   incomplete isochronous IN transfer interrupt indicates an incomplete
 *   isochronous IN transfer on at least one of the isochronous IN endpoints.
 *
 ****************************************************************************/

#ifdef CONFIG_USBDEV_ISOCHRONOUS
static inline void nrf54l_isocininterrupt(struct nrf54l_usbdev_s *priv)
{
  struct nrf54l_ep_s *privep;
  uint32_t regaddr;
  uint32_t doepctl;
  uint32_t dsts;
  bool eonum;
  bool soffn;
  int i;

  /* The application must read the endpoint control register for all
   * isochronous IN endpoints to detect endpoints with incomplete IN data
   * transfers.
   */

  for (i = 0; i < NRF54L_NENDPOINTS; i++)
    {
      /* Is this an isochronous IN endpoint? */

