raiden00pl/nuttx/arch/arm/src/nrf54l/nrf54l_usbd.c
      privep = &priv->epin[i];
      if (privep->eptype != USB_EP_ATTR_XFER_ISOC)
        {
          /* No... keep looking */

          continue;
        }

      /* Is there an active read request on the isochronous OUT endpoint? */

      if (!privep->active)
        {
          /* No.. the endpoint is not actively transmitting data */

          continue;
        }

      /* Check if this is the endpoint that had the incomplete transfer */

      regaddr = NRF54L_USBD_DIEPCTL(privep->epphy);
      doepctl = nrf54l_getreg(regaddr);
      dsts    = nrf54l_getreg(NRF54L_USBD_DSTS);

      /* EONUM = 0:even frame, 1:odd frame
       * SOFFN = Frame number of the received SOF
       */

      eonum = ((doepctl & OTG_DIEPCTL_EONUM) != 0);
      soffn = ((dsts & OTG_DSTS_SOFFN0) != 0);

      if (eonum != soffn)
        {
          /* Not this endpoint */

          continue;
        }

      /* For isochronous IN endpoints with incomplete transfers,
       * the application must discard the data in the memory and
       * disable the endpoint.
       */

      nrf54l_req_complete(privep, -EIO);
      nrf54l_epin_disable(privep);
      break;
    }
}
#endif

/****************************************************************************
 * Name: nrf54l_isocoutinterrupt
 *
 * Description:
 *   Incomplete periodic transfer interrupt
 *
 ****************************************************************************/

#ifdef CONFIG_USBDEV_ISOCHRONOUS
static inline void nrf54l_isocoutinterrupt(struct nrf54l_usbdev_s *priv)
{
  struct nrf54l_ep_s *privep;
  uint32_t regaddr;
  uint32_t doepctl;
  uint32_t dsts;
  bool eonum;
  bool soffn;
  int i;

  /* When it receives an IISOOXFR interrupt, the application must read the
   * control registers of all isochronous OUT endpoints to determine which
   * endpoints had an incomplete transfer in the current microframe. An
   * endpoint transfer is incomplete if both the following conditions are
   * true:
   *
   *   DOEPCTLx:EONUM = DSTS:SOFFN[0], and
   *   DOEPCTLx:EPENA = 1
   */

  for (i = 0; i < NRF54L_NENDPOINTS; i++)
    {
      /* Is this an isochronous OUT endpoint? */

      privep = &priv->epout[i];
      if (privep->eptype != USB_EP_ATTR_XFER_ISOC)
        {
          /* No... keep looking */

          continue;
        }

      /* Is there an active read request on the isochronous OUT endpoint? */

      if (!privep->active)
        {
          /* No.. the endpoint is not actively transmitting data */

          continue;
        }

      /* Check if this is the endpoint that had the incomplete transfer */

      regaddr = NRF54L_USBD_DOEPCTL(privep->epphy);
      doepctl = nrf54l_getreg(regaddr);
      dsts    = nrf54l_getreg(NRF54L_USBD_DSTS);

      /* EONUM = 0:even frame, 1:odd frame
       * SOFFN = Frame number of the received SOF
       */

      eonum = ((doepctl & OTG_DOEPCTL_EONUM) != 0);
      soffn = ((dsts & OTG_DSTS_SOFFN0) != 0);

      if (eonum != soffn)
        {
          /* Not this endpoint */

          continue;
        }

      /* For isochronous OUT endpoints with incomplete transfers,
       * the application must discard the data in the memory and
       * disable the endpoint.
       */

      nrf54l_req_complete(privep, -EIO);
      nrf54l_epout_disable(privep);
      break;
    }
}
#endif

/****************************************************************************
 * Name: nrf54l_usbinterrupt
 *
 * Description:
 *   USB interrupt handler
 *
 ****************************************************************************/

static int nrf54l_usbinterrupt(int irq, void *context, void *arg)
{
  /* At present, there is only a single OTG  device support. Hence it is
   * pre-allocated as g_usbdev.  However, in most code, the private data
   * structure will be referenced using the 'priv' pointer (rather than the
   * global data) in order to simplify any future support for multiple
   * devices.
   */

  struct nrf54l_usbdev_s *priv = &g_usbdev;
  uint32_t regval;
  uint32_t reserved;

  usbtrace(TRACE_INTENTRY(NRF54L_TRACEINTID_USB), 0);

  if (!nrf54l_ready(priv))
    {
      return OK;
    }

  /* Assure that we are in device mode */

  DEBUGASSERT((nrf54l_getreg(NRF54L_USBD_GINTSTS) & OTG_GINTSTS_CMOD) ==
               OTG_GINTSTS_DEVMODE);

  /* Get the state of all enabled interrupts.  We will do this repeatedly
   * some interrupts (like RXFLVL) will generate additional interrupting
   * events.
   */

  for (; ; )
    {
      /* Get the set of pending, un-masked interrupts */

      regval  = nrf54l_getreg(NRF54L_USBD_GINTSTS);
      reserved = (regval & OTG_GINT_RESERVED);
      regval &= nrf54l_getreg(NRF54L_USBD_GINTMSK);

      /* With out modifying the reserved bits, acknowledge all
       * **Writable** pending irqs we will service below
       */

      nrf54l_putreg(((regval | reserved) & OTG_GINT_RC_W1),
                     NRF54L_USBD_GINTSTS);

      /* Break out of the loop when there are no further pending (and
       * unmasked) interrupts to be processes.
       */

      if (regval == 0)
        {
          break;
        }

      usbtrace(TRACE_INTDECODE(NRF54L_TRACEINTID_INTPENDING),
              (uint16_t)regval);

      /* OUT endpoint interrupt. The core sets this bit to indicate that an
       * interrupt is pending on one of the OUT endpoints of the core.
       */

      if ((regval & OTG_GINT_OEP) != 0)
        {
          usbtrace(TRACE_INTDECODE(NRF54L_TRACEINTID_EPOUT),
                  (uint16_t)regval);
          nrf54l_epout_interrupt(priv);
        }

      /* IN endpoint interrupt.  The core sets this bit to indicate that
       * an interrupt is pending on one of the IN endpoints of the core.
       */

      if ((regval & OTG_GINT_IEP) != 0)
        {
          usbtrace(TRACE_INTDECODE(NRF54L_TRACEINTID_EPIN),
                  (uint16_t)regval);
          nrf54l_epin_interrupt(priv);
        }

      /* Host/device mode mismatch error interrupt */

#ifdef CONFIG_DEBUG_USB
      if ((regval & OTG_GINT_MMIS) != 0)
        {
          usbtrace(TRACE_INTDECODE(NRF54L_TRACEINTID_MISMATCH),
                  (uint16_t)regval);
        }
#endif

