raiden00pl/nuttx/arch/arm/src/nrf54l/nrf54l_usbd.c
      /* Resume/remote wakeup detected interrupt */

      if ((regval & OTG_GINT_WKUP) != 0)
        {
          usbtrace(TRACE_INTDECODE(NRF54L_TRACEINTID_WAKEUP),
                  (uint16_t)regval);
          nrf54l_resumeinterrupt(priv);
        }

      /* USB suspend interrupt */

      if ((regval & OTG_GINT_USBSUSP) != 0)
        {
          usbtrace(TRACE_INTDECODE(NRF54L_TRACEINTID_SUSPEND),
                  (uint16_t)regval);
          nrf54l_suspendinterrupt(priv);
        }

      /* Start of frame interrupt */

#ifdef CONFIG_USBDEV_SOFINTERRUPT
      if ((regval & OTG_GINT_SOF) != 0)
        {
          usbtrace(TRACE_INTDECODE(NRF54L_TRACEINTID_SOF),
                  (uint16_t)regval);
          usbdev_sof_irq(&priv->usbdev, nrf54l_getframe(&priv->usbdev));
        }
#endif

      /* RxFIFO non-empty interrupt.  Indicates that there is at least one
       * packet pending to be read from the RxFIFO.
       */

      if ((regval & OTG_GINT_RXFLVL) != 0)
        {
          usbtrace(TRACE_INTDECODE(NRF54L_TRACEINTID_RXFIFO),
                  (uint16_t)regval);
          nrf54l_rxinterrupt(priv);
        }

      /* USB reset interrupt */

      if ((regval & (OTG_GINT_USBRST | OTG_GINT_RSTDET)) != 0)
        {
          usbtrace(TRACE_INTDECODE(NRF54L_TRACEINTID_DEVRESET),
                  (uint16_t)regval);

          /* Perform the device reset */

          nrf54l_usbreset(priv);
          usbtrace(TRACE_INTEXIT(NRF54L_TRACEINTID_USB), 0);
          return OK;
        }

      /* Enumeration done interrupt */

      if ((regval & OTG_GINT_ENUMDNE) != 0)
        {
          usbtrace(TRACE_INTDECODE(NRF54L_TRACEINTID_ENUMDNE),
                  (uint16_t)regval);
          nrf54l_enuminterrupt(priv);
        }

      /* Incomplete isochronous IN transfer interrupt.  When the core finds
       * non-empty any of the isochronous IN endpoint FIFOs scheduled for
       * the current frame non-empty, the core generates an IISOIXFR
       * interrupt.
       */

#ifdef CONFIG_USBDEV_ISOCHRONOUS
      if ((regval & OTG_GINT_IISOIXFR) != 0)
        {
          usbtrace(TRACE_INTDECODE(NRF54L_TRACEINTID_IISOIXFR),
                  (uint16_t)regval);
          nrf54l_isocininterrupt(priv);
        }

      /* Incomplete isochronous OUT transfer.  For isochronous OUT
       * endpoints, the XFRC interrupt may not always be asserted. If the
       * core drops isochronous OUT data packets, the application could fail
       * to detect the XFRC interrupt.  The incomplete Isochronous OUT data
       * interrupt indicates that an XFRC interrupt was not asserted on at
       * least one of the isochronous OUT endpoints. At this point, the
       * endpoint with the incomplete transfer remains enabled, but no active
       * transfers remain in progress on this endpoint on the USB.
       */

      if ((regval & OTG_GINT_IISOOXFR) != 0)
        {
          usbtrace(TRACE_INTDECODE(NRF54L_TRACEINTID_IISOOXFR),
                  (uint16_t)regval);
          nrf54l_isocoutinterrupt(priv);
        }
#endif
    }

  usbtrace(TRACE_INTEXIT(NRF54L_TRACEINTID_USB), 0);
  return OK;
}

/****************************************************************************
 * Endpoint operations
 ****************************************************************************/

/****************************************************************************
 * Name: nrf54l_enablegonak
 *
 * Description:
 *   Enable global OUT NAK mode
 *
 ****************************************************************************/

static void nrf54l_enablegonak(struct nrf54l_ep_s *privep)
{
  uint32_t regval;

  /* First, make sure that there is no GNOAKEFF interrupt pending. */

#if 0
  nrf54l_putreg(OTG_GINT_GONAKEFF, NRF54L_USBD_GINTSTS);
#endif

  /* Enable Global OUT NAK mode in the core. */

  regval = nrf54l_getreg(NRF54L_USBD_DCTL);
  regval |= OTG_DCTL_SGONAK;
  nrf54l_putreg(regval, NRF54L_USBD_DCTL);

#if 0
  /* Wait for the GONAKEFF interrupt that indicates that the OUT NAK
   * mode is in effect.  When the interrupt handler pops the OUTNAK word
   * from the RxFIFO, the core sets the GONAKEFF interrupt.
   */

  while ((nrf54l_getreg(NRF54L_USBD_GINTSTS) & OTG_GINT_GONAKEFF) == 0);
  nrf54l_putreg(OTG_GINT_GONAKEFF, NRF54L_USBD_GINTSTS);

#else
  /* Since we are in the interrupt handler, we cannot wait inline for the
   * GONAKEFF because it cannot occur until service the RXFLVL global
   * interrupt and pop the OUTNAK word from the RxFIFO.
   *
   * Perhaps it is sufficient to wait for Global OUT NAK status to be
   * reported in OTG DCTL register?
   */

  while ((nrf54l_getreg(NRF54L_USBD_DCTL) & OTG_DCTL_GONSTS) == 0);
#endif
}

/****************************************************************************
 * Name: nrf54l_disablegonak
 *
 * Description:
 *   Disable global OUT NAK mode
 *
 ****************************************************************************/

static void nrf54l_disablegonak(struct nrf54l_ep_s *privep)
{
  uint32_t regval;

  /* Set the "Clear the Global OUT NAK bit" to disable global OUT NAK mode */

  regval  = nrf54l_getreg(NRF54L_USBD_DCTL);
  regval |= OTG_DCTL_CGONAK;
  nrf54l_putreg(regval, NRF54L_USBD_DCTL);
}

/****************************************************************************
 * Name: nrf54l_epout_configure
 *
 * Description:
 *   Configure an OUT endpoint, making it usable
 *
 * Input Parameters:
 *   privep    - a pointer to an internal endpoint structure
 *   eptype    - The type of the endpoint
 *   maxpacket - The max packet size of the endpoint
 *
 ****************************************************************************/

static int nrf54l_epout_configure(struct nrf54l_ep_s *privep,
                                 uint8_t eptype, uint16_t maxpacket)
{
  int mpsiz;
  uint32_t mpsmask = OTG_DOEPCTL_MPSIZ_MASK;
  uint32_t regaddr;
  uint32_t regval;

  usbtrace(TRACE_EPCONFIGURE, privep->epphy);

  /* EP0 uses an encoded packet size; other endpoints use a byte count. */

