raiden00pl/nuttx/arch/arm/src/nrf54l/nrf54l_usbd.c
  if (privep->epphy == EP0)
    {
      mpsiz = nrf54l_ep0_mpsiz(maxpacket);
      if (mpsiz < 0 || eptype != USB_EP_ATTR_XFER_CONTROL)
        {
          return -EINVAL;
        }

      mpsmask = OTG_DOEPCTL0_MPSIZ_MASK;
    }
  else
    {
      mpsiz = (maxpacket << OTG_DOEPCTL_MPSIZ_SHIFT);
    }

  /* EP0 is always active.  Other active endpoints retain their
   * configuration.
   */

  regaddr = NRF54L_USBD_DOEPCTL(privep->epphy);
  regval  = nrf54l_getreg(regaddr);
  if (privep->epphy == EP0 || (regval & OTG_DOEPCTL_USBAEP) == 0)
    {
      if (regval & OTG_DOEPCTL_NAKSTS)
        {
          regval |= OTG_DOEPCTL_CNAK;
        }

      regval &= ~(mpsmask | OTG_DOEPCTL_EPTYP_MASK);
      regval |= mpsiz;
      regval |= (eptype << OTG_DOEPCTL_EPTYP_SHIFT);
      regval |= OTG_DOEPCTL_USBAEP;
      if (privep->epphy != EP0)
        {
          regval |= OTG_DOEPCTL_SD0PID;
        }

      nrf54l_putreg(regval, regaddr);

      /* Save the endpoint configuration */

      privep->ep.maxpacket = maxpacket;
      privep->eptype       = eptype;
      privep->stalled      = false;
      privep->active       = false;
      privep->zlp          = false;
    }

  /* Enable the interrupt for this endpoint */

  regval = nrf54l_getreg(NRF54L_USBD_DAINTMSK);
  regval |= OTG_DAINT_OEP(privep->epphy);
  nrf54l_putreg(regval, NRF54L_USBD_DAINTMSK);
  return OK;
}

/****************************************************************************
 * Name: nrf54l_epin_configure
 *
 * Description:
 *   Configure an IN endpoint, making it usable
 *
 * Input Parameters:
 *   privep    - a pointer to an internal endpoint structure
 *   eptype    - The type of the endpoint
 *   maxpacket - The max packet size of the endpoint
 *
 ****************************************************************************/

static int nrf54l_epin_configure(struct nrf54l_ep_s *privep,
                                uint8_t eptype, uint16_t maxpacket)
{
  int mpsiz;
  uint32_t mpsmask = OTG_DIEPCTL_MPSIZ_MASK;
  uint32_t regaddr;
  uint32_t regval;

  usbtrace(TRACE_EPCONFIGURE, privep->epphy);

  /* EP0 uses an encoded packet size; other endpoints use a byte count. */

  if (privep->epphy == EP0)
    {
      mpsiz = nrf54l_ep0_mpsiz(maxpacket);
      if (mpsiz < 0 || eptype != USB_EP_ATTR_XFER_CONTROL)
        {
          return -EINVAL;
        }

      mpsmask = OTG_DIEPCTL0_MPSIZ_MASK;
    }
  else
    {
      mpsiz = (maxpacket << OTG_DIEPCTL_MPSIZ_SHIFT);
    }

  /* EP0 is always active.  Other active endpoints retain their
   * configuration.
   */

  regaddr = NRF54L_USBD_DIEPCTL(privep->epphy);
  regval  = nrf54l_getreg(regaddr);
  if (privep->epphy == EP0 || (regval & OTG_DIEPCTL_USBAEP) == 0)
    {
      if (regval & OTG_DIEPCTL_NAKSTS)
        {
          regval |= OTG_DIEPCTL_CNAK;
        }

      regval &= ~(mpsmask | OTG_DIEPCTL_EPTYP_MASK |
                  OTG_DIEPCTL_TXFNUM_MASK);
      regval |= mpsiz;
      regval |= (eptype << OTG_DIEPCTL_EPTYP_SHIFT);
      regval |= (privep->epphy << OTG_DIEPCTL_TXFNUM_SHIFT);
      regval |= OTG_DIEPCTL_USBAEP;
      if (privep->epphy != EP0)
        {
          regval |= OTG_DIEPCTL_SD0PID;
        }

      nrf54l_putreg(regval, regaddr);

      /* Save the endpoint configuration */

      privep->ep.maxpacket = maxpacket;
      privep->eptype       = eptype;
      privep->stalled      = false;
      privep->active       = false;
      privep->zlp          = false;
    }

  /* Enable the interrupt for this endpoint */

  regval = nrf54l_getreg(NRF54L_USBD_DAINTMSK);
  regval |= OTG_DAINT_IEP(privep->epphy);
  nrf54l_putreg(regval, NRF54L_USBD_DAINTMSK);

  return OK;
}

/****************************************************************************
 * Name: nrf54l_ep_configure
 *
 * Description:
 *   Configure endpoint, making it usable
 *
 * Input Parameters:
 *   ep   - the struct usbdev_ep_s instance obtained from allocep()
 *   desc - A struct usb_epdesc_s instance describing the endpoint
 *   last - true if this this last endpoint to be configured.  Some hardware
 *          needs to take special action when all of the endpoints have been
 *          configured.
 *
 ****************************************************************************/

static int nrf54l_ep_configure(struct usbdev_ep_s *ep,
                              const struct usb_epdesc_s *desc,
                              bool last)
{
  struct nrf54l_ep_s *privep = (struct nrf54l_ep_s *)ep;
  uint16_t maxpacket;
  uint8_t  eptype;
  irqstate_t flags;
  int ret;

  usbtrace(TRACE_EPCONFIGURE, privep->epphy);
  DEBUGASSERT(desc->addr == ep->eplog);

  /* Initialize EP capabilities */

  maxpacket = GETUINT16(desc->mxpacketsize);
  eptype    = desc->attr & USB_EP_ATTR_XFERTYPE_MASK;

  if (maxpacket == 0 || maxpacket > 1024 ||
      (privep->isin && maxpacket > NRF54L_TXFIFO_WORDS * 4))
    {
      return -EINVAL;
    }

  flags = enter_critical_section();
  if (!nrf54l_ready(privep->dev))
    {
      leave_critical_section(flags);
      return -ESHUTDOWN;
    }

  /* Setup Endpoint Control Register */

  if (privep->isin)
    {
      ret = nrf54l_epin_configure(privep, eptype, maxpacket);
    }
  else
    {
      ret = nrf54l_epout_configure(privep, eptype, maxpacket);
    }

  leave_critical_section(flags);
  return ret;
}

/****************************************************************************
 * Name: nrf54l_ep0_configure
 *
 * Description:
 *   Reset Usb engine
 *
 ****************************************************************************/

static void nrf54l_ep0_configure(struct nrf54l_usbdev_s *priv)
{
  /* Enable EP0 IN and OUT */

  nrf54l_epin_configure(&priv->epin[EP0], USB_EP_ATTR_XFER_CONTROL,
                       CONFIG_USBDEV_EP0_MAXSIZE);
  nrf54l_epout_configure(&priv->epout[EP0], USB_EP_ATTR_XFER_CONTROL,
                        CONFIG_USBDEV_EP0_MAXSIZE);
}

/****************************************************************************
 * Name: nrf54l_epout_disable
 *
 * Description:
 *   Disable an OUT endpoint will no longer be used
 *
 ****************************************************************************/

static void nrf54l_epout_disable(struct nrf54l_ep_s *privep)
{
  uint32_t regaddr;
  uint32_t regval;
  irqstate_t flags;

  usbtrace(TRACE_EPDISABLE, privep->epphy);

  /* Is this an IN or an OUT endpoint */

  /* Before disabling any OUT endpoint, the application must enable
   * Global OUT NAK mode in the core.
   */

  flags = enter_critical_section();
  nrf54l_enablegonak(privep);

  /* Disable the required OUT endpoint by setting the EPDIS and SNAK bits
   * int DOECPTL register.
   */

  regaddr = NRF54L_USBD_DOEPCTL(privep->epphy);
  regval  = nrf54l_getreg(regaddr);
  regval &= ~OTG_DOEPCTL_USBAEP;
  regval |= (OTG_DOEPCTL_EPDIS | OTG_DOEPCTL_SNAK);
  nrf54l_putreg(regval, regaddr);

  /* Wait for the EPDISD interrupt which indicates that the OUT
   * endpoint is completely disabled.
   */

#if 0 /* Doesn't happen */
  regaddr = NRF54L_USBD_DOEPINT(privep->epphy);
  while ((nrf54l_getreg(regaddr) & OTG_DOEPINT_EPDISD) == 0);
#else
  /* REVISIT: */

