raiden00pl/nuttx/arch/arm/src/nrf54l/nrf54l_usbd.c
  up_udelay(10);
#endif

  /* Clear the EPDISD interrupt indication */

  nrf54l_putreg(OTG_DOEPINT_EPDISD, NRF54L_USBD_DOEPINT(privep->epphy));

  /* Then disable the Global OUT NAK mode to continue receiving data
   * from other non-disabled OUT endpoints.
   */

  nrf54l_disablegonak(privep);

  /* Disable endpoint interrupts */

  regval  = nrf54l_getreg(NRF54L_USBD_DAINTMSK);
  regval &= ~OTG_DAINT_OEP(privep->epphy);
  nrf54l_putreg(regval, NRF54L_USBD_DAINTMSK);

  /* Cancel any queued read requests */

  nrf54l_req_cancel(privep, -ESHUTDOWN);

  leave_critical_section(flags);
}

/****************************************************************************
 * Name: nrf54l_epin_disable
 *
 * Description:
 *   Disable an IN endpoint when it will no longer be used
 *
 ****************************************************************************/

static void nrf54l_epin_disable(struct nrf54l_ep_s *privep)
{
  uint32_t regaddr;
  uint32_t regval;
  irqstate_t flags;

  usbtrace(TRACE_EPDISABLE, privep->epphy);

  /* After USB reset, the endpoint will already be deactivated by the
   * hardware. Trying to disable again will just hang in the wait.
   */

  regaddr = NRF54L_USBD_DIEPCTL(privep->epphy);
  regval  = nrf54l_getreg(regaddr);
  if ((regval & OTG_DIEPCTL_USBAEP) == 0)
    {
      return;
    }

  /* This INEPNE wait logic is suggested by reference manual, but seems
   * to get stuck to infinite loop.
   */

#if 0
  /* Make sure that there is no pending IPEPNE interrupt (because we are
   * to poll this bit below).
   */

  nrf54l_putreg(OTG_DIEPINT_INEPNE, NRF54L_USBD_DIEPINT(privep->epphy));

  /* Set the endpoint in NAK mode */

  regaddr = NRF54L_USBD_DIEPCTL(privep->epphy);
  regval  = nrf54l_getreg(regaddr);
  regval &= ~OTG_DIEPCTL_USBAEP;
  regval |= (OTG_DIEPCTL_EPDIS | OTG_DIEPCTL_SNAK);
  nrf54l_putreg(regval, regaddr);

  /* Wait for the INEPNE interrupt that indicates that we are now in
   * NAK mode
   */

  regaddr = NRF54L_USBD_DIEPINT(privep->epphy);
  while ((nrf54l_getreg(regaddr) & OTG_DIEPINT_INEPNE) == 0);

  /* Clear the INEPNE interrupt indication */

  nrf54l_putreg(OTG_DIEPINT_INEPNE, regaddr);
#endif

  /* Deactivate and disable the endpoint by setting the EPDIS and SNAK bits
   * the DIEPCTLx register.
   */

  flags = enter_critical_section();
  regaddr = NRF54L_USBD_DIEPCTL(privep->epphy);
  regval  = nrf54l_getreg(regaddr);
  regval &= ~OTG_DIEPCTL_USBAEP;
  regval |= (OTG_DIEPCTL_EPDIS | OTG_DIEPCTL_SNAK);
  nrf54l_putreg(regval, regaddr);

  /* Wait for the EPDISD interrupt which indicates that the IN
   * endpoint is completely disabled.
   */

  regaddr = NRF54L_USBD_DIEPINT(privep->epphy);
  while ((nrf54l_getreg(regaddr) & OTG_DIEPINT_EPDISD) == 0);

  /* Clear the EPDISD interrupt indication */

  regval = nrf54l_getreg(regaddr);
  regval |= OTG_DIEPINT_EPDISD;
  nrf54l_putreg(regval, regaddr);

  /* Flush any data remaining in the TxFIFO */

  nrf54l_txfifo_flush(OTG_GRSTCTL_TXFNUM_D(privep->epphy));

  /* Disable endpoint interrupts */

  regval  = nrf54l_getreg(NRF54L_USBD_DAINTMSK);
  regval &= ~OTG_DAINT_IEP(privep->epphy);
  nrf54l_putreg(regval, NRF54L_USBD_DAINTMSK);

  /* Cancel any queued write requests */

  nrf54l_req_cancel(privep, -ESHUTDOWN);
  leave_critical_section(flags);
}

/****************************************************************************
 * Name: nrf54l_ep_disable
 *
 * Description:
 *   The endpoint will no longer be used
 *
 ****************************************************************************/

static int nrf54l_ep_disable(struct usbdev_ep_s *ep)
{
  struct nrf54l_ep_s *privep = (struct nrf54l_ep_s *)ep;
  irqstate_t flags;

#ifdef CONFIG_DEBUG_FEATURES
  if (!ep)
    {
      usbtrace(TRACE_DEVERROR(NRF54L_TRACEERR_INVALIDPARMS), 0);
      return -EINVAL;
    }
#endif

  usbtrace(TRACE_EPDISABLE, privep->epphy);

  flags = enter_critical_section();
  if (!nrf54l_ready(privep->dev))
    {
      nrf54l_req_cancel(privep, -ESHUTDOWN);
      privep->active = false;
      leave_critical_section(flags);
      return OK;
    }

  /* Is this an IN or an OUT endpoint */

  if (privep->isin)
    {
      /* Disable the IN endpoint */

      nrf54l_epin_disable(privep);
    }
  else
    {
      /* Disable the OUT endpoint */

      nrf54l_epout_disable(privep);
    }

  leave_critical_section(flags);
  return OK;
}

/****************************************************************************
 * Name: nrf54l_ep_allocreq
 *
 * Description:
 *   Allocate an I/O request
 *
 ****************************************************************************/

static struct usbdev_req_s *nrf54l_ep_allocreq(struct usbdev_ep_s *ep)
{
  struct nrf54l_req_s *privreq;

#ifdef CONFIG_DEBUG_FEATURES
  if (!ep)
    {
      usbtrace(TRACE_DEVERROR(NRF54L_TRACEERR_INVALIDPARMS), 0);
      return NULL;
    }
#endif

  usbtrace(TRACE_EPALLOCREQ, ((struct nrf54l_ep_s *)ep)->epphy);

  privreq = kmm_malloc(sizeof(struct nrf54l_req_s));
  if (!privreq)
    {
      usbtrace(TRACE_DEVERROR(NRF54L_TRACEERR_ALLOCFAIL), 0);
      return NULL;
    }

  memset(privreq, 0, sizeof(struct nrf54l_req_s));
  return &privreq->req;
}

/****************************************************************************
 * Name: nrf54l_ep_freereq
 *
 * Description:
 *   Free an I/O request
 *
 ****************************************************************************/

static void nrf54l_ep_freereq(struct usbdev_ep_s *ep,
                             struct usbdev_req_s *req)
{
  struct nrf54l_req_s *privreq = (struct nrf54l_req_s *)req;

#ifdef CONFIG_DEBUG_FEATURES
  if (!ep || !req)
    {
      usbtrace(TRACE_DEVERROR(NRF54L_TRACEERR_INVALIDPARMS), 0);
      return;
    }
#endif

  usbtrace(TRACE_EPFREEREQ, ((struct nrf54l_ep_s *)ep)->epphy);
  kmm_free(privreq);
}

/****************************************************************************
 * Name: nrf54l_ep_allocbuffer
 *
 * Description:
 *   Allocate an I/O buffer
 *
 ****************************************************************************/

#ifdef CONFIG_USBDEV_DMA
static void *nrf54l_ep_allocbuffer(struct usbdev_ep_s *ep, unsigned bytes)
{
  usbtrace(TRACE_EPALLOCBUFFER, ((struct nrf54l_ep_s *)ep)->epphy);

