raiden00pl/nuttx/arch/arm/src/nrf54l/nrf54l_usbd.c
              priv->epavail[in] &= ~(1 << epno);

              /* And return the pointer to the standard endpoint structure */

              leave_critical_section(flags);
              return in ? &priv->epin[epno].ep : &priv->epout[epno].ep;
            }
        }

      /* We should not get here */
    }

  usbtrace(TRACE_DEVERROR(NRF54L_TRACEERR_NOEP), (uint16_t)eplog);
  leave_critical_section(flags);
  return NULL;
}

/****************************************************************************
 * Name: nrf54l_ep_free
 *
 * Description:
 *   Free the previously allocated endpoint
 *
 ****************************************************************************/

static void nrf54l_ep_free(struct usbdev_s *dev,
                          struct usbdev_ep_s *ep)
{
  struct nrf54l_usbdev_s *priv = (struct nrf54l_usbdev_s *)dev;
  struct nrf54l_ep_s *privep = (struct nrf54l_ep_s *)ep;
  irqstate_t flags;

  usbtrace(TRACE_DEVFREEEP, (uint16_t)privep->epphy);

  if (priv && privep)
    {
      /* Mark the endpoint as available */

      flags = enter_critical_section();
      priv->epavail[privep->isin] |= (1 << privep->epphy);
      leave_critical_section(flags);
    }
}

/****************************************************************************
 * Name: nrf54l_getframe
 *
 * Description:
 *   Returns the current frame number
 *
 ****************************************************************************/

static int nrf54l_getframe(struct usbdev_s *dev)
{
  struct nrf54l_usbdev_s *priv = (struct nrf54l_usbdev_s *)dev;
  uint32_t regval;
  irqstate_t flags;

  usbtrace(TRACE_DEVGETFRAME, 0);

  /* Return the last frame number of the last SOF detected by the hardware */

  flags = enter_critical_section();
  if (!nrf54l_ready(priv))
    {
      leave_critical_section(flags);
      return -ESHUTDOWN;
    }

  regval = nrf54l_getreg(NRF54L_USBD_DSTS);
  leave_critical_section(flags);
  return (int)((regval & OTG_DSTS_SOFFN_MASK) >> OTG_DSTS_SOFFN_SHIFT);
}

/****************************************************************************
 * Name: nrf54l_wakeup
 *
 * Description:
 *   Exit suspend mode.
 *
 ****************************************************************************/

static int nrf54l_wakeup(struct usbdev_s *dev)
{
  struct nrf54l_usbdev_s *priv = (struct nrf54l_usbdev_s *)dev;
  uint32_t regval;
  irqstate_t flags;

  usbtrace(TRACE_DEVWAKEUP, 0);

  /* Is wakeup enabled? */

  flags = enter_critical_section();
  if (!nrf54l_ready(priv))
    {
      leave_critical_section(flags);
      return -ESHUTDOWN;
    }

  if (priv->wakeup)
    {
      /* Yes... is the core suspended? */

      regval = nrf54l_getreg(NRF54L_USBD_DSTS);
      if ((regval & OTG_DSTS_SUSPSTS) != 0)
        {
          /* Activate Remote wakeup signaling */

          regval  = nrf54l_getreg(NRF54L_USBD_DCTL);
          regval |= OTG_DCTL_RWUSIG;
          nrf54l_putreg(regval, NRF54L_USBD_DCTL);
          up_mdelay(5);
          regval &= ~OTG_DCTL_RWUSIG;
          nrf54l_putreg(regval, NRF54L_USBD_DCTL);
        }
    }

  leave_critical_section(flags);
  return OK;
}

/****************************************************************************
 * Name: nrf54l_selfpowered
 *
 * Description:
 *   Sets/clears the device self-powered feature
 *
 ****************************************************************************/

static int nrf54l_selfpowered(struct usbdev_s *dev, bool selfpowered)
{
  struct nrf54l_usbdev_s *priv = (struct nrf54l_usbdev_s *)dev;

  usbtrace(TRACE_DEVSELFPOWERED, (uint16_t)selfpowered);

#ifdef CONFIG_DEBUG_FEATURES
  if (!dev)
    {
      usbtrace(TRACE_DEVERROR(NRF54L_TRACEERR_INVALIDPARMS), 0);
      return -ENODEV;
    }
#endif

  priv->selfpowered = selfpowered;
  return OK;
}

/****************************************************************************
 * Name: nrf54l_pullup
 *
 * Description:
 *   Software-controlled connect to/disconnect from USB host
 *
 ****************************************************************************/

static int nrf54l_pullup(struct usbdev_s *dev, bool enable)
{
  struct nrf54l_usbdev_s *priv = (struct nrf54l_usbdev_s *)dev;
  irqstate_t flags;
  int ret;

  usbtrace(TRACE_DEVPULLUP, (uint16_t)enable);

  flags = enter_critical_section();
  priv->connected = enable;
  if (!enable && priv->active)
    {
      nrf54l_usbhs_pullup(false);
    }

  ret = work_queue(LPWORK, &priv->vbuswork, nrf54l_vbus_worker, priv, 0);
  leave_critical_section(flags);
  return ret == -EBUSY ? OK : ret;
}

/****************************************************************************
 * Name: nrf54l_setaddress
 *
 * Description:
 *   Set the devices USB address
 *
 ****************************************************************************/

static void nrf54l_setaddress(struct nrf54l_usbdev_s *priv, uint16_t address)
{
  uint32_t regval;

  /* Set the device address in the DCFG register */

  regval = nrf54l_getreg(NRF54L_USBD_DCFG);
  regval &= ~OTG_DCFG_DAD_MASK;
  regval |= ((uint32_t)address << OTG_DCFG_DAD_SHIFT);
  nrf54l_putreg(regval, NRF54L_USBD_DCFG);

  /* Are we now addressed?  (i.e., do we have a non-NULL device
   * address?)
   */

  if (address != 0)
    {
      priv->devstate  = DEVSTATE_ADDRESSED;
      priv->addressed = true;
    }
  else
    {
      priv->devstate  = DEVSTATE_DEFAULT;
      priv->addressed = false;
    }
}

/****************************************************************************
 * Name: nrf54l_txfifo_flush
 *
 * Description:
 *   Flush the specific TX fifo.
 *
 ****************************************************************************/

static int nrf54l_txfifo_flush(uint32_t txfnum)
{
  uint32_t regval;
  uint32_t timeout;

  /* Initiate the TX FIFO flush operation */

  regval = OTG_GRSTCTL_TXFFLSH | txfnum;
  nrf54l_putreg(regval, NRF54L_USBD_GRSTCTL);

  /* Wait for the FLUSH to complete */

  for (timeout = 0; timeout < NRF54L_FLUSH_DELAY; timeout++)
    {
      regval = nrf54l_getreg(NRF54L_USBD_GRSTCTL);
      if ((regval & OTG_GRSTCTL_TXFFLSH) == 0)
        {
          break;
        }
    }

