raiden00pl/nuttx/arch/arm/src/nrf54l/nrf54l_usbd.c
  /* Wait for 3 PHY Clocks */

  up_udelay(3);
  return OK;
}

/****************************************************************************
 * Name: nrf54l_rxfifo_flush
 *
 * Description:
 *   Flush the RX fifo.
 *
 ****************************************************************************/

static int nrf54l_rxfifo_flush(void)
{
  uint32_t regval;
  uint32_t timeout;

  /* Initiate the RX FIFO flush operation */

  nrf54l_putreg(OTG_GRSTCTL_RXFFLSH, NRF54L_USBD_GRSTCTL);

  /* Wait for the FLUSH to complete */

  for (timeout = 0; timeout < NRF54L_FLUSH_DELAY; timeout++)
    {
      regval = nrf54l_getreg(NRF54L_USBD_GRSTCTL);
      if ((regval & OTG_GRSTCTL_RXFFLSH) == 0)
        {
          break;
        }
    }

  /* Wait for 3 PHY Clocks */

  up_udelay(3);
  return OK;
}

/****************************************************************************
 * Name: nrf54l_swinitialize
 *
 * Description:
 *   Initialize all driver data structures.
 *
 ****************************************************************************/

static void nrf54l_swinitialize(struct nrf54l_usbdev_s *priv)
{
  struct nrf54l_ep_s *privep;
  int i;

  /* Initialize the device state structure */

  memset(priv, 0, sizeof(struct nrf54l_usbdev_s));

  priv->usbdev.ops = &g_devops;
  priv->usbdev.ep0 = &priv->epin[EP0].ep;

  priv->epavail[0] = NRF54L_EP_AVAILABLE;
  priv->epavail[1] = NRF54L_EP_AVAILABLE;

  /* Initialize the endpoint lists */

  for (i = 0; i < NRF54L_NENDPOINTS; i++)
    {
      /* Set endpoint operations, reference to driver structure (not
       * really necessary because there is only one controller), and
       * the physical endpoint number (which is just the index to the
       * endpoint).
       */

      privep           = &priv->epin[i];
      privep->ep.ops   = &g_epops;
      privep->dev      = priv;
      privep->isin     = 1;

      /* The index, i, is the physical endpoint address;  Map this
       * to a logical endpoint address usable by the class driver.
       */

      privep->epphy    = i;
      privep->ep.eplog = NRF54L_EPPHYIN2LOG(i);

      /* Control until endpoint is activated */

      privep->eptype       = USB_EP_ATTR_XFER_CONTROL;
      privep->ep.maxpacket = CONFIG_USBDEV_EP0_MAXSIZE;
    }

  /* Initialize the endpoint lists */

  for (i = 0; i < NRF54L_NENDPOINTS; i++)
    {
      /* Set endpoint operations, reference to driver structure (not
       * really necessary because there is only one controller), and
       * the physical endpoint number (which is just the index to the
       * endpoint).
       */

      privep           = &priv->epout[i];
      privep->ep.ops   = &g_epops;
      privep->dev      = priv;

      /* The index, i, is the physical endpoint address;  Map this
       * to a logical endpoint address usable by the class driver.
       */

      privep->epphy    = i;
      privep->ep.eplog = NRF54L_EPPHYOUT2LOG(i);

      /* Control until endpoint is activated */

      privep->eptype       = USB_EP_ATTR_XFER_CONTROL;
      privep->ep.maxpacket = CONFIG_USBDEV_EP0_MAXSIZE;
    }
}

/****************************************************************************
 * Name: nrf54l_hwinitialize
 *
 * Description:
 *   Configure the OTG  core for operation.
 *
 ****************************************************************************/

static int nrf54l_hwinitialize(struct nrf54l_usbdev_s *priv)
{
  uint32_t regval;
  uint32_t timeout;
  uint32_t address;
  int i;

  /* At start-up the core is in FS/HS mode. */

  /* Disable global interrupts by clearing the GINTMASK bit in the GAHBCFG
   * register; Set the TXFELVL bit in the GAHBCFG register so that TxFIFO
   * interrupts will occur when the TxFIFO is truly empty
   * (not just half full).
   */

  nrf54l_putreg(OTG_GAHBCFG_TXFELVL, NRF54L_USBD_GAHBCFG);

  /* Common USB OTG core initialization */

  /* Wait for AHB master IDLE state */

  for (timeout = 0; timeout < NRF54L_READY_DELAY; timeout++)
    {
      up_udelay(3);
      regval = nrf54l_getreg(NRF54L_USBD_GRSTCTL);
      if ((regval & OTG_GRSTCTL_AHBIDL) != 0)
        {
          break;
        }
    }

  if (timeout == NRF54L_READY_DELAY)
    {
      return -ETIMEDOUT;
    }

  /* Then perform the core soft reset. */

  regval = nrf54l_getreg(NRF54L_USBD_GRSTCTL);
  regval |= OTG_GRSTCTL_CSRST;
  nrf54l_putreg(regval, NRF54L_USBD_GRSTCTL);
  for (timeout = 0; timeout < NRF54L_READY_DELAY; timeout++)
    {
      up_udelay(1);
      regval = nrf54l_getreg(NRF54L_USBD_GRSTCTL);
      if ((regval & OTG_GRSTCTL_CSRST) == 0 ||
          (regval & OTG_GRSTCTL_CSRSTDONE) != 0)
        {
          break;
        }
    }

  if (timeout == NRF54L_READY_DELAY)
    {
      return -ETIMEDOUT;
    }

  /* CSFTRSTDONE is write-one-to-clear on the LM20 core. */

  nrf54l_putreg(regval & ~OTG_GRSTCTL_CSRST, NRF54L_USBD_GRSTCTL);
  up_udelay(3);

  /* Force device mode with the LM20 16-bit UTMI+ PHY. */

  regval = OTG_GUSBCFG_FDMOD | OTG_GUSBCFG_PHYIF |
           OTG_GUSBCFG_TRDT(5);
  nrf54l_putreg(regval, NRF54L_USBD_GUSBCFG);
  up_mdelay(50);

  if (priv->vbus_changed || !nrf54l_usbhs_vbus())
    {
      return -ENODEV;
    }

  /* The FIFO depth is reported in 32-bit words by the DWC2 core. */

  regval = nrf54l_getreg(NRF54L_USBD_GHWCFG3) >>
           OTG_GHWCFG3_DFIFODEPTH_SHIFT;
  if (regval < NRF54L_RXFIFO_WORDS + NRF54L_EP0_TXFIFO_WORDS +
               (NRF54L_NENDPOINTS - 1) * NRF54L_TXFIFO_WORDS)
    {
      return -ENOSPC;
    }

  /* Initialize device mode */

  /* Restart the PHY Clock */

  nrf54l_putreg(0, NRF54L_USBD_PCGCCTL);

  /* Device configuration register */

  regval = nrf54l_getreg(NRF54L_USBD_DCFG);
  regval &= ~OTG_DCFG_PFIVL_MASK;
  regval |= OTG_DCFG_PFIVL_80PCT;
  nrf54l_putreg(regval, NRF54L_USBD_DCFG);

  /* Set device high or full speed */

  regval = nrf54l_getreg(NRF54L_USBD_DCFG);
  regval &= ~OTG_DCFG_DSPD_MASK;
#ifdef CONFIG_USBDEV_DUALSPEED
  regval |= OTG_DCFG_DSPD_HS;
#else
  regval |= OTG_DCFG_DSPD_FSHS;
#endif
  nrf54l_putreg(regval, NRF54L_USBD_DCFG);

