raiden00pl/nuttx/arch/arm/src/nrf54l/nrf54l_usbd.c
  /* Set Rx FIFO size */

  nrf54l_putreg(NRF54L_RXFIFO_WORDS, NRF54L_USBD_GRXFSIZ);

  address = NRF54L_RXFIFO_WORDS;
  regval  = (address << OTG_DIEPTXF0_TX0FD_SHIFT) |
            (NRF54L_EP0_TXFIFO_WORDS << OTG_DIEPTXF0_TX0FSA_SHIFT);
  nrf54l_putreg(regval, NRF54L_USBD_DIEPTXF0);
  address += NRF54L_EP0_TXFIFO_WORDS;
  for (i = 1; i < NRF54L_NENDPOINTS; i++)
    {
      regval = (address << OTG_DIEPTXF_INEPTXSA_SHIFT) |
               (NRF54L_TXFIFO_WORDS << OTG_DIEPTXF_INEPTXFD_SHIFT);
      nrf54l_putreg(regval, NRF54L_USBD_DIEPTXF(i));
      address += NRF54L_TXFIFO_WORDS;
    }

  /* Flush the FIFOs */

  nrf54l_txfifo_flush(OTG_GRSTCTL_TXFNUM_DALL);
  nrf54l_rxfifo_flush();

  /* Clear all pending Device Interrupts */

  nrf54l_putreg(0, NRF54L_USBD_DIEPMSK);
  nrf54l_putreg(0, NRF54L_USBD_DOEPMSK);
  nrf54l_putreg(0, NRF54L_USBD_DIEPEMPMSK);
  nrf54l_putreg(0xffffffff, NRF54L_USBD_DAINT);
  nrf54l_putreg(0, NRF54L_USBD_DAINTMSK);

  /* Configure all IN endpoints */

  for (i = 0; i < NRF54L_NENDPOINTS; i++)
    {
      regval = nrf54l_getreg(NRF54L_USBD_DIEPCTL(i));
      if ((regval & OTG_DIEPCTL_EPENA) != 0)
        {
          /* The endpoint is already enabled */

          regval = OTG_DIEPCTL_EPENA | OTG_DIEPCTL_SNAK;
        }
      else
        {
          regval = 0;
        }

      nrf54l_putreg(regval, NRF54L_USBD_DIEPCTL(i));
      nrf54l_putreg(0, NRF54L_USBD_DIEPTSIZ(i));
      nrf54l_putreg(0xff, NRF54L_USBD_DIEPINT(i));
    }

  /* Configure all OUT endpoints */

  for (i = 0; i < NRF54L_NENDPOINTS; i++)
    {
      regval = nrf54l_getreg(NRF54L_USBD_DOEPCTL(i));
      if ((regval & OTG_DOEPCTL_EPENA) != 0)
        {
          /* The endpoint is already enabled */

          regval = OTG_DOEPCTL_EPENA | OTG_DOEPCTL_SNAK;
        }
      else
        {
          regval = 0;
        }

      nrf54l_putreg(regval, NRF54L_USBD_DOEPCTL(i));
      nrf54l_putreg(0, NRF54L_USBD_DOEPTSIZ(i));
      nrf54l_putreg(0xff, NRF54L_USBD_DOEPINT(i));
    }

  /* Disable all interrupts. */

  nrf54l_putreg(0, NRF54L_USBD_GINTMSK);

  /* Clear any pending USB_OTG Interrupts */

  nrf54l_putreg(0xffffffff, NRF54L_USBD_GOTGINT);

  /* Clear any pending interrupts */

  regval = nrf54l_getreg(NRF54L_USBD_GINTSTS);
  regval &=  OTG_GINT_RESERVED;
  nrf54l_putreg(regval | OTG_GINT_RC_W1, NRF54L_USBD_GINTSTS);

  /* Enable the interrupts in the INTMSK */

  regval = (OTG_GINT_RXFLVL | OTG_GINT_USBSUSP | OTG_GINT_WKUP |
            OTG_GINT_ENUMDNE | OTG_GINT_IEP | OTG_GINT_OEP |
            OTG_GINT_USBRST);

#ifdef CONFIG_USBDEV_ISOCHRONOUS
  regval |= (OTG_GINT_IISOIXFR | OTG_GINT_IISOOXFR);
#endif

#ifdef CONFIG_USBDEV_SOFINTERRUPT
  regval |= OTG_GINT_SOF;
#endif

#ifdef CONFIG_DEBUG_USB
  regval |= OTG_GINT_MMIS;
#endif

  nrf54l_putreg(regval, NRF54L_USBD_GINTMSK);

  /* Enable the USB global interrupt by setting GINTMSK in the global OTG
   * AHB configuration register; Set the TXFELVL bit in the GAHBCFG
   * register so that TxFIFO interrupts will occur when the TxFIFO is truly
   * empty (not just half full).
   */

  nrf54l_putreg(OTG_GAHBCFG_GINTMSK | OTG_GAHBCFG_TXFELVL,
               NRF54L_USBD_GAHBCFG);
  return OK;
}

/****************************************************************************
 * Name: nrf54l_disconnect
 *
 * Description:
 *   Cancel requests without touching core registers after VBUS removal.
 *   The caller holds g_usbdev_lock and prevents new controller starts.
 *
 ****************************************************************************/

static void nrf54l_disconnect(struct nrf54l_usbdev_s *priv)
{
  irqstate_t flags;
  int i;

  flags = enter_critical_section();
  up_disable_irq(NRF54L_IRQ_USBHS);
  priv->active = false;
  priv->usbdev.speed = USB_SPEED_UNKNOWN;
  priv->configured = false;
  priv->addressed = false;
  priv->wakeup = false;
  leave_critical_section(flags);

  nrf54l_usbhs_disable();

  flags = enter_critical_section();
  if (priv->driver)
    {
      CLASS_DISCONNECT(priv->driver, &priv->usbdev);
    }

  for (i = 0; i < NRF54L_NENDPOINTS; i++)
    {
      nrf54l_req_cancel(&priv->epin[i], -ESHUTDOWN);
      nrf54l_req_cancel(&priv->epout[i], -ESHUTDOWN);
      priv->epin[i].active = false;
      priv->epout[i].active = false;
      priv->epin[i].stalled = false;
      priv->epout[i].stalled = false;
    }

  leave_critical_section(flags);
}

/****************************************************************************
 * Name: nrf54l_vbus_worker
 *
 * Description:
 *   Perform PHY and controller startup delays outside interrupt context.
 *
 ****************************************************************************/

static void nrf54l_vbus_worker(void *arg)
{
  struct nrf54l_usbdev_s *priv = arg;
  irqstate_t flags;
  int ret;

  ret = nxmutex_lock(&g_usbdev_lock);
  if (ret < 0)
    {
      return;
    }

  if (!priv->initialized)
    {
      goto out;
    }

  if (priv->active && (priv->vbus_changed || !priv->connected ||
                       !nrf54l_usbhs_vbus()))
    {
      nrf54l_disconnect(priv);
    }

  if (!priv->driver || !priv->connected || !nrf54l_usbhs_vbus())
    {
      goto out;
    }

  if (!priv->active)
    {
      priv->vbus_changed = false;
      ret = nrf54l_usbhs_enable();
      if (ret < 0)
        {
          goto out;
        }

      ret = nrf54l_hwinitialize(priv);
      if (ret < 0)
        {
          nrf54l_usbhs_disable();
          uerr("ERROR: USB core initialization failed: %d\n", ret);
          goto out;
        }

      flags = enter_critical_section();
      if (priv->vbus_changed || !nrf54l_usbhs_vbus() || !priv->connected)
        {
          leave_critical_section(flags);
          nrf54l_usbhs_disable();
          goto out;
        }

      nrf54l_usbreset(priv);
      if (!priv->connected)
        {
          leave_critical_section(flags);
          nrf54l_usbhs_disable();
          goto out;
        }

      priv->active = true;
      modifyreg32(NRF54L_USBD_DCTL, OTG_DCTL_SDIS, 0);
      up_enable_irq(NRF54L_IRQ_USBHS);
      leave_critical_section(flags);
    }

  if (priv->connected)
    {
      nrf54l_usbhs_pullup(true);
    }

out:
  nxmutex_unlock(&g_usbdev_lock);
}

/****************************************************************************
 * Name: nrf54l_vbus_interrupt
 *
 * Description:
 *   Stop core interrupt processing until the worker handles the transition.
 *
 ****************************************************************************/

static int nrf54l_vbus_interrupt(int irq, void *context, void *arg)
{
  struct nrf54l_usbdev_s *priv = arg;

  priv->vbus_changed = true;
  up_disable_irq(NRF54L_IRQ_USBHS);
  work_queue(LPWORK, &priv->vbuswork, nrf54l_vbus_worker, priv, 0);
  return OK;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: arm_usbinitialize
 *
 * Description:
 *   Initialize USB hardware.
 *
 * Assumptions:
 * - This function is called very early in the initialization sequence
 *
 ****************************************************************************/

