raiden00pl/nuttx/arch/arm/src/nrf54l/nrf54l_usbd.c
void arm_usbinitialize(void)
{
  /* At present, there is only a single OTG device support. Hence it is
   * pre-allocated as g_usbdev.  However, in most code, the private data
   * structure will be referenced using the 'priv' pointer (rather than the
   * global data) in order to simplify any future support for multiple
   * devices.
   */

  struct nrf54l_usbdev_s *priv = &g_usbdev;
  int ret;

  usbtrace(TRACE_DEVINIT, 0);

  if (priv->initialized)
    {
      return;
    }

  /* Initialize the driver data structure */

  nrf54l_swinitialize(priv);

  /* Attach the OTG interrupt handler */

  ret = irq_attach(NRF54L_IRQ_USBHS, nrf54l_usbinterrupt, NULL);
  if (ret < 0)
    {
      uerr("ERROR: irq_attach failed: %d\n", ret);
      goto errout;
    }

  /* Core register access waits until VBUS and the PHY clock are ready. */

  priv->initialized = true;
  ret = nrf54l_usbhs_initialize(nrf54l_vbus_interrupt, priv);
  if (ret < 0)
    {
      priv->initialized = false;
      irq_detach(NRF54L_IRQ_USBHS);
      goto errout;
    }

  return;

errout:
  uerr("ERROR: USB initialization failed: %d\n", ret);
}

/****************************************************************************
 * Name: arm_usbuninitialize
 ****************************************************************************/

void arm_usbuninitialize(void)
{
  /* At present, there is only a single OTG  device support. Hence it is
   * pre-allocated as g_usbdev.  However, in most code, the private data
   * structure will be referenced using the 'priv' pointer (rather than the
   * global data) in order to simplify any future support for multiple
   * devices.
   */

  struct nrf54l_usbdev_s *priv = &g_usbdev;

  usbtrace(TRACE_DEVUNINIT, 0);

  if (!priv->initialized)
    {
      return;
    }

  if (priv->driver)
    {
      usbtrace(TRACE_DEVERROR(NRF54L_TRACEERR_DRIVERREGISTERED), 0);
      usbdev_unregister(priv->driver);
    }

  up_disable_irq(NRF54L_IRQ_VREGUSB);
  up_disable_irq(NRF54L_IRQ_USBHS);
  work_cancel_sync(LPWORK, &priv->vbuswork);
  nxmutex_lock(&g_usbdev_lock);
  nrf54l_disconnect(priv);
  nrf54l_usbhs_uninitialize();
  irq_detach(NRF54L_IRQ_USBHS);
  priv->initialized = false;
  nxmutex_unlock(&g_usbdev_lock);
}

/****************************************************************************
 * Name: usbdev_register
 *
 * Description:
 *   Register a USB device class driver. The class driver's bind() method
 *   will be called to bind it to a USB device driver.
 *
 ****************************************************************************/

int usbdev_register(struct usbdevclass_driver_s *driver)
{
  /* At present, there is only a single OTG  device support. Hence it is
   * pre-allocated as g_usbdev.  However, in most code, the private data
   * structure will be referenced using the 'priv' pointer (rather than the
   * global data) in order to simplify any future support for multiple
   * devices.
   */

  struct nrf54l_usbdev_s *priv = &g_usbdev;
  int ret;

  usbtrace(TRACE_DEVREGISTER, 0);

  if (!driver || !driver->ops || !driver->ops->bind ||
      !driver->ops->unbind || !driver->ops->disconnect ||
      !driver->ops->setup)
    {
      usbtrace(TRACE_DEVERROR(NRF54L_TRACEERR_INVALIDPARMS), 0);
      return -EINVAL;
    }

  if (!priv->initialized)
    {
      return -ENODEV;
    }

  ret = nxmutex_lock(&g_usbdev_lock);
  if (ret < 0)
    {
      return ret;
    }

  if (priv->driver)
    {
      usbtrace(TRACE_DEVERROR(NRF54L_TRACEERR_DRIVER), 0);
      nxmutex_unlock(&g_usbdev_lock);
      return -EBUSY;
    }

  /* First hook up the driver */

  priv->driver = driver;

  /* Then bind the class driver */

  ret = CLASS_BIND(driver, &priv->usbdev);
  if (ret)
    {
      usbtrace(TRACE_DEVERROR(NRF54L_TRACEERR_BINDFAILED), (uint16_t)-ret);
      priv->driver = NULL;
      priv->connected = false;
    }
  else
    {
      ret = nrf54l_pullup(&priv->usbdev, true);
      if (ret < 0)
        {
          priv->connected = false;
          CLASS_UNBIND(driver, &priv->usbdev);
          priv->driver = NULL;
        }
    }

  nxmutex_unlock(&g_usbdev_lock);
  return ret;
}

/****************************************************************************
 * Name: usbdev_unregister
 *
 * Description:
 *   Un-register usbdev class driver.If the USB device is connected to a USB
 *   host, it will first disconnect().  The driver is also requested to
 *   unbind() and clean up any device state, before this procedure finally
 *   returns.
 *
 ****************************************************************************/

int usbdev_unregister(struct usbdevclass_driver_s *driver)
{
  /* At present, there is only a single OTG device support. Hence it is
   * pre-allocated as g_usbdev.  However, in most code, the private data
   * structure will be referenced using the 'priv' pointer (rather than the
   * global data) in order to simplify any future support for multiple
   * devices.
   */

  struct nrf54l_usbdev_s *priv = &g_usbdev;
  int ret;

  usbtrace(TRACE_DEVUNREGISTER, 0);

  ret = nxmutex_lock(&g_usbdev_lock);
  if (ret < 0)
    {
      return ret;
    }

  if (driver == NULL || driver != priv->driver)
    {
      usbtrace(TRACE_DEVERROR(NRF54L_TRACEERR_INVALIDPARMS), 0);
      nxmutex_unlock(&g_usbdev_lock);
      return -EINVAL;
    }

  /* Reset the hardware and cancel all requests.  All requests must be
   * canceled while the class driver is still bound.
   */

  priv->connected = false;
  nrf54l_disconnect(priv);

  /* Unbind the class driver */

  CLASS_UNBIND(driver, &priv->usbdev);

  /* Unhook the driver */

  priv->driver = NULL;
  nxmutex_unlock(&g_usbdev_lock);

  return OK;
}

#endif /* CONFIG_USBDEV */
